[
  {
    "Session ID": "900332",
    "Title": "Beyond Documents: Implementing Knowledge Graphs in Legal Agents",
    "Description": "Structured Representations are pretty important in the law, where the relationships between clauses, documents, entities, and multiple parties matter. Structured Representation means Structured Context Injection. Better Context, Less Hallucinations. We walk through a couple of case studies of systems that we’ve built in production for legal use-cases - from recursive contractual clause retrieval, to HITL legal reasoning news agents.\r\n\r\nYou'll gain insights into how structured representations significantly improve the effectiveness and reliability of legal agents.\r\n",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Tom Smoker",
    "Companies": "WhyHow.AI",
    "Company Domains": "whyhow.ai",
    "Titles": "Co-Founder"
  },
  {
    "Session ID": "911821",
    "Title": "A2A & MCP: Automating Business Processes with LLMs",
    "Description": "Ever wished your webhooks could think for themselves? Join us to discover how A2A agents can transform passive webhook endpoints into intelligent workflow processors.\r\n\r\nIn this session, we'll show you how to build a system that automatically spawns AI Agents to handle incoming webhooks. \r\n\r\nUsing Google's Agent-to-Agent framework and MCP, you'll learn how to create dynamic AI agents that respond to events, communicate with external services, and make decisions based on content analysis.\r\n\r\nSee the future of workflow automation where webhooks don't just trigger actions—they trigger intelligence!",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Damien Murphy",
    "Companies": "Bench Computing",
    "Company Domains": "bench.io",
    "Titles": "Full Stack Developer"
  },
  {
    "Session ID": "913965",
    "Title": "The AI Engineer’s Guide to Raising VC",
    "Description": "A no fluff, all tactics discussion. More AI engineers should build startups, the world needs more software. But there’s a way to raise VC and it’s hard to do it if you’ve never seen it done. We are going to walk through the exact playbook to raise your first round of funding. We will show you real pitch decks, real cold emails and real term sheets so when you go out to raise your first round of funding, you are setup to do it. Every AI Engineer should be equip to start their own company and this session makes sure raising $$$ is not going to be the blocker.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Dani Grant, Chelcie Taylor",
    "Companies": "Jam.dev, Notable Capital",
    "Company Domains": "jam.dev, notablecap.com",
    "Titles": "CEO, Investor"
  },
  {
    "Session ID": "916143",
    "Title": "Make Your AI Agents Remember What They Do!",
    "Description": "Are you ready to give your AI agents a memory upgrade? \r\nJoin us for a hands-on, fast-paced workshop where we explore how memory can transform your agents.\r\n\r\nWhat You'll Do:\r\nSet Up Leading Memory Solutions: Get practical, side-by-side experience with open-source tools including AIUS, Cognee, LangMem, MemGPT, Mem0, and Zep.\r\n\r\nExplore Memory Types: Learn the theory behind agent memory, including long-term, short-term, episodic, semantic, and other memory types.\r\n\r\nRun Experiments: Test how memory improves recall, contextual awareness, and reasoning in autonomous agents.\r\n\r\nCompare Implementations: Get a snapshot of how different solutions implement memory—what’s built-in, what’s flexible, and what’s experimental.\r\n\r\nWhether you’re working on AI copilots, agentic workflows, or research prototypes—this workshop will help you embed real memory into your AI stack.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Mark Bain",
    "Companies": "AIUS Technologies",
    "Company Domains": "gmail.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "927353",
    "Title": "Engineering Better Evals: Scalable LLM Evaluation Pipelines",
    "Description": "As LLM-powered products become more sophisticated, the need for scalable, reliable evaluation pipelines has never been more critical. This session dives deep into advanced LLM evaluation strategies that move beyond toy benchmarks and toward real-world production impact.\r\nWe’ll explore how to architect and implement evaluation pipelines that work across both online and offline environments—reducing dev complexity and accelerating iteration. The session will cover:\r\n\r\n- LLM-as-a-judge frameworks\r\n- Human-in-the-loop evaluation\r\n- How hybrid approaches unlock more robust and nuanced performance assessments\r\n\r\nWe’ll break down technical architectures, share real implementation patterns, and examine trade-offs between evaluation techniques to help engineers make informed choices.\r\nWhether you’re building from scratch or refining existing workflows, this talk offers practical strategies for crafting efficient, scalable, and accurate eval pipelines tailored to custom LLM products.\r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Dat  Ngo",
    "Companies": "Arize",
    "Company Domains": "arize.com",
    "Titles": "Director of Solutions, EMEA"
  },
  {
    "Session ID": "933450",
    "Title": "Code Review for the Age of AI",
    "Description": "Today’s codebases move faster than ever, making human code reviews increasingly challenging. In this quick technical talk, we’ll explore how AI-driven code review technology changes the game, rapidly identifying subtle logic errors, hidden security vulnerabilities, and performance bottlenecks before they ever reach production. Drawing on insights from over millions of real-world pull requests reviewed by Diamond, Graphite’s AI code review agent, you'll learn how teams are achieving faster merges and higher code quality.\r\n\r\nWe'll wrap up with a brief introduction to Diamond, demonstrating how effortlessly it integrates into your GitHub workflows, followed by live demos and Q\\&A with our engineers at the booth.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite",
    "Company Domains": "graphite.com",
    "Titles": "CPO"
  },
  {
    "Session ID": "933453",
    "Title": "Onboarding your robot coworkers: customizing AI code review agents to your team’s style",
    "Description": "It’s not enough that AI can review and understand your code in a vacuum. In order to be effective, AI agents need context around your entire codebase and understand the nuances of the way your team works. This talk will examine technical approaches and best practices for teaching AI tools to enforce highly customized style guides and coding conventions no matter what tech stack you’re working in.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite",
    "Company Domains": "graphite.com",
    "Titles": "CPO"
  },
  {
    "Session ID": "933493",
    "Title": "Realtime conversational video with Pipecat and Tavus",
    "Description": "Tavus shipped the world's first realtime video avatar platform last year. Developers use Tavus' conversational video APIs to create education, social, and customer support agents. The Tavus team built their innovative product using the Pipecat open source framework and Daily's global WebRTC infrastructure. Join us for a technical deep dive into conversational video.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Chad Bailey, Brian Johnson, Kwindla Kramer",
    "Companies": "Daily, Tavus, Daily",
    "Company Domains": "daily.co, tavus.ai, daily.co",
    "Titles": "Engineer, Staff Engineer, Engineer"
  },
  {
    "Session ID": "933593",
    "Title": "Building Voice Agents with Gemini and Pipecat",
    "Description": "Hands-on workshop led by engineers from Google and Daily",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Chad Bailey, Kwindla Kramer",
    "Companies": "Daily, Daily",
    "Company Domains": "daily.co, daily.co",
    "Titles": "Engineer, Engineer"
  },
  {
    "Session ID": "933632",
    "Title": "Agentic Coding with Windsurf",
    "Description": "Agentic coding marks a new era in software development, where AI agents take on autonomous roles in coding tasks. The Windsurf IDE embodies this shift by integrating intelligent agents like Cascade, which maintain full codebase context to perform multi-file edits, run terminal commands, and suggest changes through tools like Supercomplete and Flows. In this session, we will explore features that allow developers to guide strategy while the AI handles execution, enhancing productivity and enabling more creative, high-level work.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Numair Baseer",
    "Companies": "Windsurf",
    "Company Domains": "windsurf.com",
    "Titles": "AI Developer"
  },
  {
    "Session ID": "933633",
    "Title": "The Eyes Are The (Context) Window to The Soul: How Windsurf Gets to Know You",
    "Description": "Sometimes it seems like Windsurf knows you a little too well. It's one thing to generate generic code, but to predict your next intent? From matching existing code patterns and styles to tracking how local changes affect the larger codebase, this talk digs into the technical challenges of context awareness and why simply indexing code falls short. Relive our journey tackling the core issue in the AI IDE space : balancing retrieval quality with latency constraints and scaling effectively as codebases grow. For those curious about the infrastructure behind context-aware AI, this talk offers insights into our approach of turning massive codebases into collections of useful context.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Sam  Fertig",
    "Companies": "Windsurf",
    "Company Domains": "windsurf.com",
    "Titles": "Deployed Engineer"
  },
  {
    "Session ID": "933645",
    "Title": "Engineering Better Evals: Scalable LLM Evaluation Pipelines That Work",
    "Description": "As LLM-powered products become more sophisticated, the need for scalable, reliable evaluation pipelines has never been more critical. This session dives deep into advanced LLM evaluation strategies that move beyond toy benchmarks and toward real-world production impact.\r\n\r\nWe’ll explore how to architect and implement evaluation pipelines that work across both online and offline environments—reducing dev complexity and accelerating iteration. The session will cover:\r\n\r\n- LLM-as-a-judge frameworks\r\n- Human-in-the-loop evaluation\r\n- How hybrid approaches unlock more robust and nuanced performance assessments\r\n\r\nWe’ll break down technical architectures, share real implementation patterns, and examine trade-offs between evaluation techniques to help engineers make informed choices.\r\nWhether you’re building from scratch or refining existing workflows, this talk offers practical strategies for crafting efficient, scalable, and accurate eval pipelines tailored to custom LLM products.\r\n",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Aman Khan",
    "Companies": "Arize",
    "Company Domains": "arize.com",
    "Titles": "Director of Product, LLM"
  },
  {
    "Session ID": "933676",
    "Title": "Human-seeded Evals",
    "Description": "In this talk I'll introduce the concept of Human-seeded Evals, explain the principle and demo them with Pydantic Logfire.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Samuel Colvin",
    "Companies": "Pydantic Inc.",
    "Company Domains": "pydantic.dev",
    "Titles": "Founder"
  },
  {
    "Session ID": "933684",
    "Title": "Mastering Engineering Flow with Windsurf",
    "Description": "As experienced engineers, especially senior and staff engineers, our focus shifts towards complex problem-solving, architectural decisions, and mentoring. While AI tools promise productivity gains, Windsurf offers more than just code completion and chat assistance – it's an agentic IDE built to enhance engineering flow. This talk explores how experienced engineers can leverage Windsurf's deep contextual awareness, structured guidance, and automated workflows to tackle sophisticated and complex tasks. We'll demonstrate practical strategies for accelerating feature development, automating code maintenance and reviews, and ultimately freeing up cognitive load to focus on high-impact engineering challenges. Learn how to move beyond basic AI assistance and truly partner with Windsurf to excel in your role.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Eashan Sinha",
    "Companies": "Windsurf",
    "Company Domains": "windsurf.dev",
    "Titles": "Deployed Engineer"
  },
  {
    "Session ID": "933685",
    "Title": "Windsurf & Wonders",
    "Description": "Come learn about why Windsurf is the premiere choice for engineers and enterprises alike in applications of AI for development.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Jia Wu, Tejashwa Tiwari",
    "Companies": "Windsurf, Windsurf",
    "Company Domains": "windsurf.ai, codeium.com",
    "Titles": "Solutions Architect, Analytics and Automation Engineer"
  },
  {
    "Session ID": "933702",
    "Title": "Smarter Together: Designing Multi-Agent Systems with Shared, Evolving Memory",
    "Description": "In today’s most advanced AI systems, intelligence is no longer confined to a single model or agent—it emerges from coordination. But coordination requires memory: short-term, long-term, and shared. In this talk, we’ll break down how agent systems can store, retrieve, and evolve shared memory to become smarter over time. You'll learn what it takes to architect these continuously learning systems, how to track and improve memory quality, and why robust, flexible infrastructure is the foundation of it all. Stick around to see how this works in practice—live.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Mikiko Bazeley",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "Staff Developer Advocate"
  },
  {
    "Session ID": "933706",
    "Title": "GraphRAG: Integrating LLMs with Knowledge Graphs",
    "Description": "While traditional RAG is effective, it can struggle with complex relationships and reasoning across large knowledge bases. GraphRAG, an advanced variant, addresses these challenges by leveraging knowledge graphs to enable deeper understanding and improved response accuracy. Learn how LLMs extract key entities and relationships from your data to construct a graph structure, and how the system uses graph traversal to find related entities and enrich prompts. Stay for a live demo showcasing these concepts in action.\t",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Thibaut  Gourdel",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "Technical PMM"
  },
  {
    "Session ID": "933707",
    "Title": "Building Multimodal AI Agents (From Scratch)",
    "Description": "In this hands-on workshop, you will build a multimodal AI agent capable of processing mixed-media content—from analyzing charts and diagrams to extracting insights from documents with embedded visuals. Using MongoDB as a vector database and memory store, and Google's Gemini for multimodal reasoning, you will gain hands-on experience with multimodal data processing pipelines and agent orchestration patterns by implementing core components directly, using good ol' Python.\r\n",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Apoorva Joshi",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "AI Developer Advocate"
  },
  {
    "Session ID": "936251",
    "Title": "Windsurf Booth Session #2",
    "Description": "",
    "Session Format": "",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Windsurf Speaker",
    "Companies": "Windsurf",
    "Company Domains": "windsurf.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "936299",
    "Title": "Vibe Coding in Production",
    "Description": "What's the role of vibe coding in a production-grade applications? Join Augment Code's Matt McClernan as he speaks to engineering leaders about building with AI. ",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Matt McClernan",
    "Companies": "Augment Code",
    "Company Domains": "augmentcode.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "936816",
    "Title": "Building Protected MCP Servers",
    "Description": "Join us to see how VS Code and GitHub Copilot's expanding suite of AI features can match or even surpasses the benefits of other popular AI developer tools.  We'll focus on practical scenarios to ensure immediate applicability and work through live demos of Copilot features such as: Code generation using Edits, Planning/problem solving using Chat, Inline terminal command generation, Boilerplate code generation using Agent mode, Improving boilerplate with custom instructions and then refactoring using Agent mode and Edits, Improving test generation and code reviews with custom instructions, as well as an Introduction to MCP. \r\n",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Den Delimarsky (DEVDIV), Julia Kasper",
    "Companies": "Microsoft, unknown",
    "Company Domains": "microsoft.com, unknown",
    "Titles": "Principal Product Engineer, unknown"
  },
  {
    "Session ID": "936818",
    "Title": "Agentic Excellence: Mastering Evaluation of AI Agents with Azure AI Evaluation SDK",
    "Description": "As AI agents transition from experimental assistants to critical components of enterprise workflows, reliably evaluating their performance becomes essential. But how do you systematically measure an AI agent’s capabilities, contextual understanding, and accuracy across diverse scenarios?\r\n\r\nIn this talk, we'll dive deep into the Azure AI Evaluation SDK, an innovative tool designed to rigorously assess agentic applications. Learn how to create powerful evaluations using structured test plans, scenarios, and advanced analytics that pinpoint strengths and expose hidden weaknesses. Through practical examples and real-world case studies, you'll discover how companies are already leveraging this SDK to enhance agent trustworthiness, reliability, and performance.\r\n\r\nWhether you're developing conversational agents, data-driven decision-makers, or autonomous workflow orchestrators, this session equips you with the techniques and insights needed to ensure your AI solutions deliver exceptional value and exceed user expectations.\"\"\r\n",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Cedric  Vidal",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Principal AI Advocate"
  },
  {
    "Session ID": "936901",
    "Title": "Unlocking AI-Powered DevOps Within Your Organization",
    "Description": "\"Software development is a team sport, with many different roles, where eveyone can win. But success isn't guaranteed; it depends on specific practices, policies, and tools which enable minimally-siloed, AI-accelerated collaboration across all parts of the DevOps process, from PM to development to CI/CD and security.\r\n \r\n Discover the patterns and tools which lead to success, methods for changing the status quo, and perhaps a few horror stories. We'll touch on innersourcing, cloud development, AI, automation, governance, security, scaling and more -- with actionable learnings for everyone from small maintainer communities to F500 Enterprises.\"",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Jon Peck",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Enterprise Advocate"
  },
  {
    "Session ID": "936902",
    "Title": "Vibe Coding at Scale: Customizing AI Assistants for Enterprise Environments",
    "Description": "\"Vibe coding\" often falters in complex enterprise environments. Drawing from real implementations, this talk demonstrates systematic approaches to customizing AI assistants for challenging codebases. We'll explore specialized techniques for navigating complex architectures, evidence-based strategies for undocumented legacy systems, methodologies for maintaining context across polyglot environments, and frameworks for standardizing AI usage while preserving developer autonomy. Through case studies from finance and healthcare, we'll present a comprehensive evaluation framework that bridges the gap between AI's theoretical capabilities and practical enterprise implementation, enabling true flow-state collaboration even within the most complex development ecosystems.",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Harald Kirschner",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Principal Product Manager"
  },
  {
    "Session ID": "936903",
    "Title": "Real-world MCPs in GitHub Copilot Agent Mode",
    "Description": "As developers, we don't spend most of our time vibe-coding prototypes. More often, we're adding features, squashing bugs, and building tests for existing apps across a wide variety of services and technologies. Come learn how MCPs help GitHub Copilot to untangle real engineering problems. By allowing agent mode to securely work with data sources, testing tools, infrastructure providers, and even core DevOps tooling -- we can go beyond the hype, and solve the actual engineering problems we face every day.",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Jon Peck",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Enterprise Advocate"
  },
  {
    "Session ID": "936906",
    "Title": "GraphRAG methods to create optimized LLM context windows for retrieval",
    "Description": "",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Jonathan Larson",
    "Companies": "Microsoft Research",
    "Company Domains": "microsoft.com",
    "Titles": "Senior Principal Data Architect"
  },
  {
    "Session ID": "936907",
    "Title": "Empowering Developers to build Cutting-Edge AI experiences on device",
    "Description": "",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Meng  Tang",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "936908",
    "Title": "Agentic RAG: build a reasoning retrieval engine with Azure AI Search",
    "Description": "",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Pablo  Castro",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Corporate Vice President and Distinguished Engineer"
  },
  {
    "Session ID": "936909",
    "Title": "Battle-Test Your AI Agents: Ensuring Safety with Azure’s Red Teaming Agent",
    "Description": "",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Cedric  Vidal",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Principal AI Advocate"
  },
  {
    "Session ID": "937936",
    "Title": "Polar Signals Expo Session",
    "Description": "",
    "Session Format": "",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Matthias Loibl",
    "Companies": "Polar Signals",
    "Company Domains": "polarsignals.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "939088",
    "Title": "From Mixture of Experts to Mixture of Agents … with Super Fast Inference",
    "Description": "Our hands-on workshop will walk you through how to build your own Mixture of Agents (MoA) system using the fastest, and most capable open models available: Qwen3-32B and Llama 3.3-70B. MoA is an emerging architecture that combines the strengths of multiple large language models in a layered, agent-based design. This approach delivers superior performance by enabling specialized agents to collaborate across layers—outperforming today’s frontier models in both accuracy and efficiency.\r\n\r\nTo ground this new paradigm in its roots, we’ll also explore how Mixture of Experts (MoE) architectures continue to push the boundaries of scale and specialization. Learn how Cerebras trains state-of-the-art MoEs from Daria Soboleva, Head Research Scientist.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "",
    "Scheduled At": "",
    "Speakers": "Daniel Kim, Daria Soboleva",
    "Companies": "Cerebras, Cerebras",
    "Company Domains": "cerebras.net, gmail.com",
    "Titles": "Head of Growth, Head Research Scientist"
  },
  {
    "Session ID": "915269",
    "Title": "Shipping AI That Works: An Evaluation Framework for PMs",
    "Description": "GenAI is reshaping the product landscape, creating huge opportunities (along with new expectations) for product managers. Yet while prompt engineering and model tuning get the spotlight, one critical skill can get overlooked: rigorous evaluation.\r\n\r\nThis talk will help PMs move beyond gut-feel “vibe checks” to adopt concrete, repeatable evaluation strategies for LLM-powered products. I'll break down essential eval methodologies, from human feedback and code-based checks to cutting-edge LLM-based evaluations. Drawing on real-world examples, I'll share a practical framework PMs can use to:\r\n\r\n-Confidently evaluate AI-driven features\r\n- Ground decisions in real, repeatable data\r\n- Build trust and delight through consistent quality\r\n",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Workshop",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Aman Khan",
    "Companies": "Arize",
    "Company Domains": "arize.com",
    "Titles": "Director of Product, LLM"
  },
  {
    "Session ID": "915684",
    "Title": "Beyond Benchmarks: Strategies for Evaluating LLMs in Production",
    "Description": "Accuracy scores and leaderboard metrics look impressive—but production-grade AI requires evals that reflect real-world performance, reliability, and user happiness. Traditional benchmarks rarely help you understand how your LLM will perform when embedded in complex workflows or agentic systems. How can you realistically and adequately measure reasoning quality, agent consistency, MCP integration, and user-focused outcomes?\r\n\r\nIn this practical, example-driven talk, we'll go beyond standard benchmarks and dive into tangible evaluation strategies using various open-source frameworks like GuideLLM and lm-eval-harness. You'll see concrete examples of how to create custom eval suites tailored to your use case, integrate human-in-the-loop feedback effectively, and implement agent reliability checks that reflect production conditions. Walk away with actionable insights and best practices for evaluating and improving your LLMs, ensuring they meet real-world expectations—not just leaderboard positions!",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Taylor Jordan Smith",
    "Companies": "Red Hat",
    "Company Domains": "gmail.com",
    "Titles": "Senior Developer Advocate"
  },
  {
    "Session ID": "915928",
    "Title": "How LLMs work for Web Devs: GPT in 600 lines of Vanilla JS",
    "Description": "Don't be intimidated. Modern AI can feel like magic, but underneath the hood are principles that web developers can understand, even if you don't have a machine learning background. In this workshop, we'll explore a complete GPT-2 inference implementation built entirely in Vanilla JS. This JavaScript translation of the popular \"Spreadsheets-are-all-you-need\" approach will let you debug and step through a real LLM line by line without the overhead of learning a new language, framework, or even IDE.\r\n\r\nAll the major LLMs, including ChatGPT, Claude, DeepSeek, and Llama, inherit from GPT-2's architecture, making this exploration a solid foundation to understand modern AI systems and comprehend the latest research.\r\n\r\nWhile we won't have time to cover *everything*, you'll gain the essential knowledge to understand the key concepts that matter when building with LLMs, including how they:\r\n\r\n-Convert raw text into meaningful tokens\r\n- Represent semantic meaning through vector embeddings\r\n- Train neural networks through gradient descent\r\n- Generate text with sampling algorithms like top-k, top-p, and temperature\r\n\r\nThis intense but beginner-friendly workshop is designed specifically for web developers diving into ML and AI for the first time. It’s your \"missing AI degree\" in just two hours. You'll walk away with an intuitive mental model of how Transformers work that you can apply immediately to your own LLM-powered projects.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Ishan Anand",
    "Companies": "Independent",
    "Company Domains": "gmail.com",
    "Titles": "AI consultant"
  },
  {
    "Session ID": "916066",
    "Title": "Introduction to LLM serving with SGLang",
    "Description": "Do you want to learn how to serve models like DeepSeek and Qwen with SOTA speeds on launch day? SGLang is an open-source fast serving framework for LLMs and VLMs that generates trillions of tokens per day at companies like xAI, AMD, and Meituan. This workshop guides AI engineers who are familiar with serving models using frameworks like vLLM, Ollama, and TensorRT-LLM through deploying and optimizing their first model with SGLang, as well as providing guidance on when SGLang is the appropriate tool for LLM workloads.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Philip Kiely, Yineng Zhang",
    "Companies": "Baseten, Baseten",
    "Company Domains": "baseten.co, zhyncs.com",
    "Titles": "Developer Relations Lead, Software Engineer"
  },
  {
    "Session ID": "929509",
    "Title": "Kernels, RL, Reasoning, Reward Functions & Quantization",
    "Description": "Discover if writing custom kernels is still worth it, explore how to do Reinforcement Learning (RL) and reward functions properly, and learn why quantization is key to local LLMs - plus tips to gain accuracy.",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Unsloth AI",
    "Companies": "Unsloth AI",
    "Company Domains": "gmail.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "933714",
    "Title": "Intro to GraphRAG",
    "Description": "Learn the foundations of GraphRAG, starting with knowledge graph construction and then common retrieval patterns.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Zach Blumenfeld",
    "Companies": "Neo4j ",
    "Company Domains": "neotechnology.com",
    "Titles": "Data Science Product Specialist"
  },
  {
    "Session ID": "936933",
    "Title": "Forget RAG Pipelines—Build Production-Ready AI Agents in 15 Minutes",
    "Description": "Want to take advantage of your data, but don't want to reinvent RAG infrastructure? Join our workshop and see how you can deploy Agentic RAG in minutes using Contextual AI's managed RAG solution. We'll explore how Contextual handles intelligent parsing and chunking of your data, retrieves information with state of the art accuracy, and generates responses with a multi layered set of guardrails against hallucinations. Together, we'll build an end-to-end Agentic RAG pipeline and demonstrate its integration with Claude Desktop via MCP, so you can see how this could plug into your existing ecosystem. \r\n\r\nBy the end of this session, you'll have a functioning Agentic RAG prototype that you can easily customize and deploy to production for your specific use cases, even with complex, unstructured documents. ",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 09:00 AM",
    "Speakers": "Nina Lopatina, Rajiv Shah",
    "Companies": "Contextual AI",
    "Company Domains": "contextual.ai",
    "Titles": "Lead Developer Advocate, Chief Evangelist"
  },
  {
    "Session ID": "907684",
    "Title": "Scoring models beat LLM judges any day of the week",
    "Description": "Do you wish your LLM judge was highly accurate, rapid fast, data-tunable, and continuously integrated across your stack? This talk describes a new architecture for AI metrics based on foundation scoring models and a set of integrations that run above them. This architecture was inspired by decades of AI and machine learning development in Google Search, reinvented for the modern LLM stack by our team over the past year. \r\n\r\nWe will share the history of that trajectory and then dive into the technical details: the use of encoder models trained specifically for scoring to enable higher accuracy and lower latency and the deployment of auto-generated tunable metric trees that can combine a wide variety of soft and hard signals across your stack into a human-calibrated score. We’ll end with various examples of how these scoring models are being deployed across the whole stack from online control flows for agents, to reward models for algorithms like RL, to rankers for inference time scaling methods like ensemble generation.\r\n",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "Speakers": "David Karam",
    "Companies": "Pi Labs",
    "Company Domains": "withpi.ai",
    "Titles": "Product Director"
  },
  {
    "Session ID": "915961",
    "Title": "Ship Agents that Ship: A Hands-On Workshop for SWE Agent Builders",
    "Description": "Coding agents are transforming how software gets built, tested, and deployed, but engineering teams face a critical challenge: how to embrace this automation wave without sacrificing trust, control, or reliability.\r\nIn this 110-minute workshop, you’ll go beyond toy demos and build production-minded AI agents using Dagger, the programmable delivery engine designed for real CI/CD and AI-native workflows. Whether you're debugging failures, triaging pull requests, generating tests, or shipping features, you'll learn how to orchestrate autonomous agents that live in and around your codebase: from your laptop to your CI platform.\r\nWe’ll guide you through:\r\n\r\nBuilding real-world agents with Dagger and popular LLMs (GPT, Claude, etc.)\r\n\r\nProgramming agent environments using real languages (Go, Python, TypeScript)\r\n\r\nExecuting agent workflows locally and in GitHub Actions, so you can bring them to production\r\n\r\nUsing a composable runtime that ensures isolation, determinism, traceability, and repeatability\r\n\r\nDesigning agents that automate and enhance debugging, test generation, code review, bug fixing, and feature implementation\r\n\r\n\r\nBy the end of the workshop, you’ll walk away ready to build your own army of autonomous agents, working collaboratively across your codebase, locally and in CI, accelerating development without ceding control. Let’s build agents that don’t just talk, they ship!",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Nobhill A&B: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "Speakers": "Kyle Penfound, Jeremy Adams",
    "Companies": "Dagger, Dagger",
    "Company Domains": "pm.me, dagger.io",
    "Titles": "Ecosystem Team Member, Senior Leader"
  },
  {
    "Session ID": "935459",
    "Title": "Piloting agents in GitHub Copilot",
    "Description": "The agent capabilities added to GitHub Copilot have enhanced its ability to act as a peer programmer. Copilot can now discover and generate code based on existing standards, run tests, recover from errors, and call tools using Model Context Protocol (MCP). This workshop will guide you through piloting Copilot's agent capabilities and how to best integrate with the most widely adopted AI coding assistant in the world.\r\n\r\nKey takeaways include:\r\n\r\n- Understanding how and when to bring agents into your software development workflow\r\n- Providing context through the use of custom instructions and prompt files to ensure consistency across your team\r\n- Discovering how MCP provides access to an additional set of external tools and capabilities that the agent can use\r\n- Configuring Copilot's agentic capabilities to take advantage of your custom MCP server\r\n- Recommended best practices to help your responsibly accelerate your development while maintaining code quality and governance",
    "Session Format": "Workshop",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Nobhill C&D: Microsoft",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "Speakers": "Christopher Harrison, Christopher Harrison",
    "Companies": "GitHub, GitHub",
    "Company Domains": "github.com, github.com",
    "Titles": "Senior Dev Advocate, Senior Dev Advocate"
  },
  {
    "Session ID": "936937",
    "Title": "Circle Workshop",
    "Description": "",
    "Session Format": "Workshop",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 10:40 AM",
    "Speakers": "Corey Cooper",
    "Companies": "Circle",
    "Company Domains": "circle.com",
    "Titles": "Solutions Engineer"
  },
  {
    "Session ID": "929790",
    "Title": "Useful General Intelligence",
    "Description": "We’re all hearing that AI agents will enable AGI, but they can’t yet reliably perform even basic computer tasks. It turns out that getting AI to click, type, and scroll is more challenging than getting it to generate code. How can we build general-purpose agents that can do anything we can do on a computer? \r\n\r\nThis is our goal at the Amazon AGI SF Lab. In this talk, I’ll propose a new approach to agents that we call Useful General Intelligence. After describing how we’re solving the biggest challenges in computer use while enabling developers to access our tech in it’s earliest developmental stages, I’ll show real workflows that developers have built with Nova Act, our agentic model and SDK. ",
    "Session Format": "Keynote",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 12:40 PM",
    "Speakers": "Danielle Perszyk",
    "Companies": "Amazon",
    "Company Domains": "gmail.com",
    "Titles": "Cognitive Scientist"
  },
  {
    "Session ID": "907544",
    "Title": "Case Study + Deep Dive: Telemedicine Support Agents with LangGraph/MCP",
    "Description": "Workshop/walkthrough of a Stride/Avila Science partnership to build agentic telemedicine support",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Workshop",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Dan Mason",
    "Companies": "Stride",
    "Company Domains": "gmail.com",
    "Titles": "Principal, AI"
  },
  {
    "Session ID": "910732",
    "Title": "AI Engineering with the Google Gemini 2.5 Model Family",
    "Description": "Hands on Workshop on learning to use Gemini 2.5 Pro in combination with Agentic tooling and MCP Servers.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "SOMA: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Philipp Schmid",
    "Companies": "Google DeepMind",
    "Company Domains": "google.com",
    "Titles": "Senior AI Developer Relations Engineer"
  },
  {
    "Session ID": "916214",
    "Title": "Information Retrieval from the Ground Up",
    "Description": "Vector search is only a feature. Search engines and information retrieval have retaken their position as the foundation of RAG. This workshop takes you through decades of research, what has been working for a long time, and how it got better with Machine Learning.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Philipp Krenn",
    "Companies": "Elastic",
    "Company Domains": "xeraa.net",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "930540",
    "Title": "Every Way to Optimize Your Models with OpenAI",
    "Description": "Covering all forms of fine-tuning and prompt engineering, like SFT, DPO, RFT, prompt engineering / optimization, and agent scaffolding.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Ilan Bigio",
    "Companies": "OpenAI",
    "Company Domains": "gmail.com",
    "Titles": "Founding member, Developer Experience team"
  },
  {
    "Session ID": "933607",
    "Title": "Building Agents with Amazon Nova Act and MCP",
    "Description": "In this 2-hour workshop, participants will gain practical hands-on experience building sophisticated AI agents using Amazon's agent technologies. You'll learn to build agents that can navigate the web like humans, perform complex multi-step tasks, and leverage specialized tools through natural language commands. You’ll explore Amazon Nova Act for reliable web navigation, Model Context Protocol (MCP) for connecting agents to external data sources and APIs, and Amazon Bedrock Agents for orchestrating complex workflows. Through guided exercises, you'll create agents capable of retrieving information and taking action across web applications, all through natural language interactions. By the end of this workshop, you'll have the practical skills to build AI agents that can browse websites, interact with web interfaces, and solve multi-step problems by combining these powerful Amazon technologies.",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Du’An Lightfoot",
    "Companies": "Amazon Web Services",
    "Company Domains": "aws.amazon.com",
    "Titles": "Sr. Developer Advocate"
  },
  {
    "Session ID": "935456",
    "Title": "Real-World Development with GitHub Copilot and VS Code",
    "Description": "Join us for a hands-on workshop designed to demonstrate how VS Code and GitHub Copilot's expanding suite of AI features can match or even surpasses the benefits of other popular AI developer tools.  We'll focus on practical scenarios to ensure immediate applicability and work through live demos of Copilot features such as: Code generation using Edits, Planning/problem solving using Chat, Inline terminal command generation, Boilerplate code generation using Agent mode, Improving boilerplate with custom instructions and then refactoring using Agent mode and Edits, Improving test generation and code reviews with custom instructions, as well as an Introduction to MCP. \r\nPre Requisit - install GitHub Copilot and VS Code",
    "Session Format": "Workshop",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Workshops",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Harald Kirschner, Christopher Harrison",
    "Companies": "Microsoft, Microsoft / GitHub",
    "Company Domains": "microsoft.com, microsoft.com",
    "Titles": "Principal Product Manager, Senior Developer Advocate"
  },
  {
    "Session ID": "936905",
    "Title": "Building Code-First AI Agents with Azure AI Agent Service: A Practical introduction",
    "Description": "\"This workshop offers a hands-on introduction to developing Large Language Model (LLM)-powered AI agents using Microsoft’s Azure AI Agent Service. Participants will build a conversational agent capable of analyzing sales data, generating visualizations, and delivering actionable insights.\r\n \r\n The session takes a code-first approach using the Azure AI Foundry SDK for Python, and demonstrates how to integrate core Azure services including Azure OpenAI, Azure AI Search, and Azure Storage.\r\n \r\n Attendees will explore key concepts such as function calling, document grounding, and leveraging code interpreters to generate diagrams. The workshop also covers how to connect agents to external data sources like SQL databases (e.g., SQLite), enabling access to legacy relational systems.\r\n \r\n By the end of the session, participants will have a solid foundation for building and deploying intelligent, code-first AI agents with Azure AI Agent Service—ready to power real-world applications.\"",
    "Session Format": "Workshop",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Nobhill C&D: Microsoft",
    "Scheduled At": "3 Jun 2025 01:00 PM",
    "Speakers": "Cedric  Vidal",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Principal AI Advocate"
  },
  {
    "Session ID": "914537",
    "Title": "Building voice agents with OpenAI",
    "Description": "We'll walk through the differences between chained and speech-to-speech powered voice agents, how to approach them, best practices and transform a text-based agent into our first voice-enabled agent",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "Workshop",
    "Room": "Foothill C: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "Speakers": "Dominik Kundel",
    "Companies": "OpenAI",
    "Company Domains": "openai.com",
    "Titles": "Developer and Product Leader"
  },
  {
    "Session ID": "933560",
    "Title": "AI agents & deep context in legacy codebases - to the moon!",
    "Description": "Attendees will learn to use an AI coding agent as a fast and intuitive part of navigating and working with complex, production-grade legacy code bases. We will drop directly into the code–written in assembly–that landed the1969 Apollo 11 astronauts on the moon and, through a series of challenges, locate parts of the code tied to key functionality. Using the agent to convert a key guidance computer algorithm into a more modern programming language, attendees will then compete to see whose code has what it takes to land on the moon.",
    "Session Format": "Workshop",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "Speakers": "Forrest Brazeal",
    "Companies": "Augment Code",
    "Company Domains": "freemanandforrest.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "933688",
    "Title": "AI Pipelines and Agents in Pure TypeScript with Mastra.ai",
    "Description": "This hands-on workshop introduces Mastra.ai, a TypeScript framework that streamlines the development of agentic AI systems compared to traditional approaches using LangChain and vector databases. Participants will learn to build structured AI workflows with composable tools and reliable control, enabling them to create internal AI assistants that can handle requests like data cleaning, email drafting, and document summarization with minimal code. The session covers Mastra installation, running a local MCP server, defining tools and agents in TypeScript, using the Mastra playground, and implementing practical examples such as RAG setups and tool-chaining agents—all designed to equip attendees with the skills to develop scalable AI-driven internal tools based on sound software engineering principles rather than just experimental prompts.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Salons 2-6: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "Speakers": "Nick Nisi",
    "Companies": "WorkOS ",
    "Company Domains": "nisi.org",
    "Titles": "Software Engineer"
  },
  {
    "Session ID": "933721",
    "Title": "VoiceVision RAG - Integrating Visual Document Intelligence with Voice Response",
    "Description": "In this workshop we will explore the integration of Colpali, a cutting-edge Vision based Retrieval Model, with voice synthesis for next-generation RAG systems. We'll demonstrate how Colpali's ability to generate multi-vector embeddings directly from document images bypasses traditional OCR and complex preprocessing, while adding voice output creates a more intuitive and accessible user experience. Attendees will see how this combination handles documents with mixed textual and visual information, leading to more efficient and accurate information retrieval with natural voice responses.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Foothill G1&2: Workshops",
    "Scheduled At": "3 Jun 2025 03:30 PM",
    "Speakers": "Suman Debnath",
    "Companies": "Amazon Web Services",
    "Company Domains": "aws.amazon.com",
    "Titles": "Principal Developer Advocate"
  },
  {
    "Session ID": "936800",
    "Title": "Spark to System: Building the Open Agentic Web",
    "Description": "AI builders no longer ask whether to use agents—but how many and how fast. In this kickoff keynote, Microsoft’s Asha Sharma shows what happens when natural language creation meets an industrial grade backbone.  Watch live demos—to see agents move from idea to production in real time. Walk out with the commands, repos, and open protocols to build your piece of the agentic web.",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 09:20 AM",
    "Speakers": "Asha  Sharma",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Corporate Vice President"
  },
  {
    "Session ID": "927324",
    "Title": "Conviction Session",
    "Description": "Please Fill in",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 09:40 AM",
    "Speakers": "Sarah Guo",
    "Companies": "Conviction",
    "Company Domains": "conviction.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "935987",
    "Title": "Simon Willison Keynote",
    "Description": "",
    "Session Format": "Keynote",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 10:00 AM",
    "Speakers": "Simon Willison",
    "Companies": "Lanyrd",
    "Company Domains": "lanyrd.com",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "916131",
    "Title": "Milliseconds to Magic: Real‑Time Workflows using the Gemini Live API and Pipecat",
    "Description": "The Gemini Live API GA  is now powered by Google's best cost-effective thinking model Gemini 2.5 Flash. We will do a deep dive on the capabilities that the Gemini Live API combined with Pipecat unlock for devs with special focus on session management, turn detection, tool use (including async function calls), proactivity, multilinguality and integration with telephony and other infra. We will demo some of the more innovative capabilities. We will also talk through some customer use cases - especially how customers can use Pipecat to extend these realtime multimodal capabilities to client side applications such as customer support agents, gaming agents, tutoring agents etc. In addition, we also have an experimental version of the Live API powered by with Google's native audio offering that can be tried in an experimental capacity . This experimental model  can communicate with seamless, emotive, steerable, multilingual dialogue and enhances use cases where more natural voices can be a big differentiator. ",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "Speakers": "Shrestha Basu Mallick, Kwindla Kramer",
    "Companies": "Google DeepMind, Daily",
    "Company Domains": "gmail.com, daily.co",
    "Titles": "Group Product Manager, unknown"
  },
  {
    "Session ID": "933472",
    "Title": "AI-powered entomology: Lessons from millions of AI code reviews",
    "Description": "This talk will explore insights from millions of automated code reviews, revealing trends in bugs, vulnerabilities, and code health that Graphite’s AI code review agent have uncovered. This talk will also provide meta commentary into the types of bugs AI code review agents are great at spotting, and how far the field of AI code review has come in the last year alone.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite",
    "Company Domains": "graphite.dev",
    "Titles": "CPO"
  },
  {
    "Session ID": "933692",
    "Title": "Architecting Agent Memory: Principles, Patterns, and Best Practices",
    "Description": "In the rapidly evolving landscape of agentic systems, memory management has emerged as a key pillar for building intelligent, context-aware AI Agents. Inspired by the complexity of human memory systems—such as episodic, working, semantic, and procedural memory—this talk unpacks how AI agents can achieve believability, reliability, and capability by retaining and reasoning over past experiences.\r\nWe’ll begin by establishing a conceptual framework based on real-world implementations from memory management libraries and system architectures:\r\nMemory Components representing various structured memory types (e.g., conversation, workflow, episodic, persona)\r\nMemory Modes reflecting operational strategies for short-term, long-term, and dynamic memory handling\r\nNext, the talk transitions to practical implementation patterns critical for effective memory lifecycle management:\r\nMaintaining rich conversation history and contextual awareness\r\nPersistence strategies leveraging vector databases and hybrid search\r\nMemory augmentation using embeddings, relevance scoring, and semantic retrieval\r\nProduction-ready practices for scaling memory in multi-agent ecosystems\r\nWe’ll also examine advanced memory strategies within agentic systems:\r\nMemory cascading and selective deletion\r\nIntegration of tool use and persona memory\r\nOptimizing performance around memory retrieval and LLM context window limits\r\nWhether you're developing autonomous agents, chatbots, or complex workflow orchestration systems, this talk offers knowledge and tactical insights for building AI that can remember, adapt, and improve over time.\r\nThis session is ideal for:\r\nAI engineers and agent framework developers\r\nArchitects designing Agentic RAG or multi-agent systems\r\nPractitioners building contextual, personalized AI experiences\r\nBy the end of the session, you’ll understand how to leverage memory as a strategic asset in agentic design—and walk away ready to build agents that not only act and reason but also remember.\t",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 10:45 AM",
    "Speakers": "Richmond Alake",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "Developer Advocate"
  },
  {
    "Session ID": "933709",
    "Title": "What does Enterprise Ready MCP mean?",
    "Description": "Everyone is building MCP servers: from Slack integrations to personal data tools. They're good demos, but not ready to turn into production. So, what does it take to make MCP *enterprise-ready?*\r\n\r\nWe're going to cover the end-to-end process of getting a hacky MCP server authenticated, permissioned, and secure. We'll talk about registries, SSO, audit logs, agent identifiers, autonomy for agents, and oversight. Oh and we'll use MCP to buy some stuff.\r\n\r\nCome learn the stack needed to scale your MCP to the enterprise and some fun hacks along the way.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 11:00 AM",
    "Speakers": "Tobin  South",
    "Companies": "WorkOS",
    "Company Domains": "workos.com",
    "Titles": "VP of AI Agents"
  },
  {
    "Session ID": "936298",
    "Title": "To the moon! Navigating deep context in legacy code with Augment Agent",
    "Description": "Shortened presentation-only version of our Apollo 11 workshop",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 11:00 AM",
    "Speakers": "Forrest Brazeal, Matt Ball",
    "Companies": "Augment Code, Augment Code ",
    "Company Domains": "freemanandforrest.com, augmentcode.com",
    "Titles": "Founder, unknown"
  },
  {
    "Session ID": "903524",
    "Title": "From Copilot to Colleague: Building Trustworthy Productivity Agents for High-Stakes Work",
    "Description": "This keynote will explore what it takes to move from basic generative assistants to fully agentic AI—systems that don’t just suggest but plan, act, and adapt—all within the structured, high-trust environments where professionals actually work.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Product launch",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Joel Hron",
    "Companies": "Thomson Reuters",
    "Company Domains": "thomsonreuters.com",
    "Titles": "Chief Technology Officer"
  },
  {
    "Session ID": "915028",
    "Title": "[Voice Keynote] Your realtime AI is ngmi",
    "Description": "Sean DuBois of OpenAI and Pion, and Kwindla Hultman Kramer of Daily and Pipecat, will talk about why you have to design realtime AI systems from the network layer up.\r\n\r\nMost people who build realtime AI apps and frameworks get it wrong. They build from either the model out or the app layer down. But unless you start with the network layer and build up, you'll never be able to deliver realtime audio and video streams reliably. And perhaps even worse, you'll get core primitives wrong: interruption handling, conversation state management, asynchronous function calling.\r\n\r\nSean and Kwin agree on most things: old-school realtime systems people against the rest of the world. But they disagree on some important things, too, and will argue about those things live on stage. Do you need to give developers \"thick\" client-side realtime SDKs? Can you build truly great vendor neutral APIs? (You'll be surprised which of them argues which side, on that topic.)",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Voice (07)",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Kwindla Kramer, Sean DuBois",
    "Companies": "Daily, OpenAI",
    "Company Domains": "daily.co, openai.com",
    "Titles": "Engineer, Engineer"
  },
  {
    "Session ID": "916117",
    "Title": "[Reliability Keynote] AI Automation that actually works: $100M, messy data, zero surprises",
    "Description": "We will review the different kinds of automation use-cases, and the approach we used, that will drive over a $100M of expected annual impact by deploying AI for business critical initiatives. \r\n\r\nWe will discuss what kinds of automation initiatives become possible because of Gen AI. These were not tenable before because of the amount of customization required per customer or per scenario, and the kind of data involved in these workflows. Previously, these workflows were driven manually which were both error prone and required expensive training. \r\n\r\nTo replace or augment these manual business critical processes, automation _has_ to cross a very high bar of reliability. \r\n\r\nWe will share how we addressed the inherent non-determinism of Gen AI to create a predictable system that doesn’t have any surprising failure modes. We’ll also discuss how we worked with our existing data that was spread across various systems without an expensive centralisation and clean up effort. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Agent Reliability (04)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Tanmai Gopal",
    "Companies": "Hasura",
    "Company Domains": "hasura.io",
    "Titles": "CEO"
  },
  {
    "Session ID": "921229",
    "Title": "Graph Intelligence: Enhance Reasoning and Retrieval Using Graph Analytics",
    "Description": "Advanced GraphRAG techniques apply graph ML and algorithms, wrapped into tidy notebooks.",
    "Session Format": "Workshop",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Alison Cossette, Andreas Kollegger",
    "Companies": "Neo4j , Neo4j",
    "Company Domains": "claritrace.com, neo4j.com",
    "Titles": "Developer Advocate, unknown"
  },
  {
    "Session ID": "925337",
    "Title": "[PM Keynote] Everything is ugly so go build something that isn't",
    "Description": "We're in an awkward adolescent phase of AI product (design). But what if this chaotic moment is actually our greatest opportunity? Enter the rebuilding revolution.\r\n\r\nIn this talk, we'll explore how the current state of AI interfaces offers a once-in-a-career chance to rethink fundamental UX patterns, with practical guidance on avoiding common pitfalls that plague first-generation AI products. \r\n\r\nLearn how to balance technical constraints with user needs, identify which conventional wisdom to keep versus discard, and ship AI experiences that actually delight users rather than frustrate them.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Product Management (06)",
    "Room": "Foothill G 1&2: Product Management",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Raiza Martin",
    "Companies": "Huxe",
    "Company Domains": "gmail.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "927452",
    "Title": "[Placeholder] MCP Origins",
    "Description": "Early prototypes and demos from inside anthropic that have guided our thinking around MCP",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Jerome Swannack",
    "Companies": "Anthropic",
    "Company Domains": "anthropic.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "929337",
    "Title": "Recsys Keynote: Improving Recommendation Systems & Search in the Age of LLMs",
    "Description": "Recommendation systems and search have long adopted advances in language modeling, from early adoption of Word2vec for embedding-based retrieval to the transformative impact of GRUs, Transformers, and BERT on predicting user interactions. Now, the rise of large language models (LLMs) is inspiring innovations in model architecture, scalable system designs, and richer customer experiences.\r\n\r\nIn this keynote, we'll dive into cutting-edge industry applications of LLMs in recommendation and search systems, exploring real-world implementations and measurable outcomes. Join us for an look at current trends and an exciting vision of how LLM-driven techniques will shape the future of content discovery and intelligent search.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "LLM RecSys (03)",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Eugene Yan",
    "Companies": "Amazon",
    "Company Domains": "eugeneyan.com",
    "Titles": "Principal Applied Scientist"
  },
  {
    "Session ID": "933719",
    "Title": "What every AI engineer needs to know about GPUs",
    "Description": "Every programmer needs to know a few things about hardware, like processors, memory, and disks. Due to AI systems' extreme demand for mathematical processing power, AI engineers need to know a few things about GPUs -- the world's most popular high-throughput mathematical co-processor.\r\n\r\nIn this talk, I will explain the fundamental engineering constraints and design decisions that shape GPUs and trace those up to some counter-intuitive facts about the performance characteristics of AI systems, with actionable insights for their deployers and consumers.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Charles Frye",
    "Companies": "Modal Labs",
    "Company Domains": "modal.com",
    "Titles": "Educator and Evangelist"
  },
  {
    "Session ID": "939128",
    "Title": "The Rise of the AI Architect",
    "Description": "A conversation with Clay Bavor, cofounder of Sierra, on what the AI Architect role is becoming",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Clay Bavor",
    "Companies": "Sierra",
    "Company Domains": "sierra.com",
    "Titles": "co-founder"
  },
  {
    "Session ID": "939142",
    "Title": "Bolt: The Dawn of the VibeCoder",
    "Description": "tbd",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "Tiny Teams (01)",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 11:15 AM",
    "Speakers": "Eric Simons",
    "Companies": "Bolt",
    "Company Domains": "bolt.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "904722",
    "Title": "Accelerating Investment Operations: How BlackRock Builds Custom Knowledge Apps at Scale.",
    "Description": "Investment Operations teams are the backbone of asset and investment management firms. Their day-to-day work not only enables portfolio managers to respond swiftly to market events but also ensures that complex, unstructured data flows seamlessly across the organization.\r\nIn this talk, we introduce a modular, Kubernetes-native AI framework purpose-built to scale custom Knowledge Apps across the enterprise. Designed with speed, flexibility, and compliance in mind, the framework empowers teams to launch production-grade document extraction applications in minutes instead of months, unlocking new levels of automation and efficiency for investment management workflows.\r\nWe’ll also share how this framework has helped BlackRock streamline document extraction processes, generate investment signals, reduce operational overhead, and accelerate the delivery of high-impact business use cases—all while maintaining the robustness and control required in a regulated industry.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 11:35 AM",
    "Speakers": "Vaibhav Page, Infant Vasanth",
    "Companies": "BlackRock, BlackRock",
    "Company Domains": "blackrock.com, gmail.com",
    "Titles": "Principal Engineer, Engineering Lead"
  },
  {
    "Session ID": "907834",
    "Title": "Building Applications with AI Agents",
    "Description": "Generative AI has dramatically shortened the distance between ideas and implementation, enabling faster prototyping and deployment than ever before. But while language models can streamline individual tasks, true transformation comes from combining these capabilities into intelligent, autonomous systems—AI agents.\r\n\r\nThis talk explores how to build and deploy foundation model-enabled agent systems that go beyond simple prompt chaining or chatbots. Drawing from real-world implementations and the latest research, it offers a clear and practical path to designing both single-agent and multi-agent systems capable of handling complex workflows with minimal oversight.\r\n\r\nAttendees will gain a deeper understanding of the core design principles behind agentic systems, the architectural trade-offs involved in orchestrating multiple agents, and the strategies required to develop tailored solutions that enhance efficiency and innovation. Whether just beginning or scaling up, participants will leave with actionable insights to navigate the rapidly evolving world of AI autonomy.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 11:35 AM",
    "Speakers": "Michael Albada",
    "Companies": "Microsoft Research",
    "Company Domains": "gmail.com",
    "Titles": "Machine Learning Engineer"
  },
  {
    "Session ID": "914080",
    "Title": "12 Factor Agents - Principles of Reliable LLM Applications",
    "Description": "Hi, I'm Dex. I've been hacking on AI agents for a while.\r\n\r\nI've tried every agent framework out there, from the plug-and-play crew/langchains to the \"minimalist\" smolagents of the world to the \"production grade\" langraph, griptape, etc.\r\n\r\nI've talked to a lot of really strong founders who are all building really impressive things with AI. Most of them are rolling the stack themselves. I don't see a lot of frameworks in production customer-facing agents.\r\n\r\nI've been surprised to find that most of the products out there billing themselves as \"AI Agents\" are not all that agentic. A lot of them are mostly deterministic code, with LLM steps sprinkled in at just the right points to make the experience truly magical.\r\n\r\nAgents, at least the good ones, don't follow the \"here's your prompt, here's a bag of tools, loop until you hit the goal\" pattern. Rather, they are comprised of mostly just software.\r\n\r\nSo, I set out to answer:\r\n\r\nWhat are the principles we can use to build LLM-powered software that is actually good enough to put in the hands of production customers?\r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Agent Reliability (04)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 11:35 AM",
    "Speakers": "Dexter Horthy",
    "Companies": "HumanLayer",
    "Company Domains": "humanlayer.dev",
    "Titles": "Founder"
  },
  {
    "Session ID": "931123",
    "Title": "Shipping an Enterprise Voice AI Agent in 100 Days",
    "Description": "What does it take to go from blank page to live enterprise voice agent in 100 days?\r\n\r\nThat’s the challenge we took on with Fin Voice at Intercom. Enterprise customer service demands high-quality, reliable voice interactions - but delivering that fast means wrestling with tough problems like latency, hallucinations, voice quality, and answer accuracy.\r\n\r\nWe rapidly evaluated and integrated a full voice stack - including transcription, language model, text-to-speech, retrieval-augmented generation, and telephony - while designing tools that fit seamlessly into existing human support workflows.\r\n\r\nIn this session, I’ll share key lessons from our accelerated development of Fin Voice. We'll explore the technical and operational hurdles we faced, the trade-offs we made, and how we built deployment and handover tools that work for customer service teams. You'll leave with insights into building AI-driven voice products that are both powerful and practical.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Voice (07)",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 11:35 AM",
    "Speakers": "Peter Bar",
    "Companies": "Intercom",
    "Company Domains": "intercom.io",
    "Titles": "Product Lead"
  },
  {
    "Session ID": "905305",
    "Title": "Building Hyperbolic: The On-Demand AI Cloud for GPUs, Inference, and AI Services",
    "Description": "AI moves fast. Legacy cloud can’t keep up. This session breaks down how Hyperbolic is redefining what developers should expect from AI infrastructure. We’ll cover how to instantly spin up low-cost GPUs, serve cutting-edge models with serverless inference, and deploy AI services at scale without the DevOps, rate limits, or pricing surprises. Whether you're training, fine-tuning, or just shipping fast, this is the new standard for building with AI.",
    "Session Format": "Talk",
    "Level": "Expert",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "Dr. Jasper Zhang, PhD",
    "Companies": "Hyperbolic",
    "Company Domains": "hyperbolic.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "912811",
    "Title": "When Vectors Break Down: Graph-Based RAG for Dense Enterprise Knowledge",
    "Description": "Enterprise knowledge bases are filled with \"dense mapping,\" thousands of documents where similar terms appear repeatedly, causing traditional vector retrieval to return the wrong version or irrelevant information. When our customers kept hitting this wall with their RAG systems, we knew we needed a fundamentally different approach.\r\n\r\nIn this talk, I'll share Writer's journey developing a graph-based RAG architecture that achieved 86.31% accuracy on the RobustQA benchmark while maintaining sub-second response times, significantly outperforming vector approaches.\r\n\r\nI'll survey the key techniques behind this performance leap and why graph-based approaches excel with complex enterprise information structures like product documentation, financial documents, and technical specifications that challenge traditional RAG systems. You'll learn about using specialized LLMs to build semantic relationships, how compression techniques efficiently handle concentrated enterprise data patterns, and how infusing key data points in the memory layer of the LLM lowers hallucination.\r\n\r\nThe presentation will provide practical insights into identifying when graph-based approaches make sense for your organization's specific data challenges, helping you make informed architectural decisions for your next enterprise RAG system.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "Sam Julien",
    "Companies": "Writer",
    "Company Domains": "writer.com",
    "Titles": "Director of Developer Relations"
  },
  {
    "Session ID": "914550",
    "Title": "The New Lean Startup",
    "Description": "In this session, I will be presenting a case study of Oleve's journey, revealing how we've scaled a profitable multi-product portfolio with a tiny team. I'll walk you through the emergence of \"tiny teams,\" our two-track engineering methodology that has become our blueprint, as well as an inside look at our technical alpha – specifically how we've engineered deterministic AI agents to deliver magical and reliable consumer experiences to millions. You'll learn how we've built internal tools to grow leanly and created operating playbooks to scale operations without traditional headcount requirements. I'll also share our approach to scrappy infrastructure innovation and how our investment in internal tooling has served as a critical force multiplier. Finally, I'll give an overview of parts of the profitable portfolio playbook that keeps us lean, adaptable, and profitable across multiple product lines.\r\n\r\nStructure of talk:\r\n- the tiny teams revolution\r\n- the two-track engineering approach\r\n- technical alpha: deterministic ai agents at scale\r\n- scrappy infrastructure innovation\r\n- internal tooling as a multiplier\r\n- the profitable portfolio playbook",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Tiny Teams (01)",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "Sid Bendre",
    "Companies": "Oleve",
    "Company Domains": "oleve.co",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "914842",
    "Title": "Why your product needs an AI product manager, and why it should be you",
    "Description": "So you've built another cool demo. Now what? You have hype, but not impact. You have kudos but no users. Ultimately you have a demo, but not a product.\r\n\r\nThe unique uncertainty of AI technology demands a new approach – beyond traditional product management. You need an AI Product Manager. This talk explains why this role is essential for building real AI products, using real case studies from the incubator for Artificial Intelligence in the UK Government.\r\n\r\nMore importantly, it reveals why your technical depth makes you uniquely suited to step into this critical leadership gap. Discover why could be the ideal candidate to be the AI Product Manager your product needs, and how to step into that role.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Product Management (06)",
    "Room": "Foothill G 1&2: Product Management",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "James Lowe",
    "Companies": "Incubator for AI ",
    "Company Domains": "cabinetoffice.gov.uk",
    "Titles": "Head of AI Engineering"
  },
  {
    "Session ID": "927453",
    "Title": "[PLACEHOLDER] Anthropic MCP team talk 2",
    "Description": "PLACEHOLDER",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "Jerome Swannack",
    "Companies": "Anthropic",
    "Company Domains": "anthropic.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "932498",
    "Title": "What We Learned from Using LLMs in Pinterest Search",
    "Description": "Pinterest Search integrates Large Language Models (LLMs) to enhance relevance scoring by combining search queries with rich multimodal content, including visual captions, link-based text, and user curation signals. A semi-supervised learning framework enables scaling to large and multilingual datasets, going beyond English and limited human labels. These LLM-driven models are distilled into efficient architectures for real-time serving, with experimental validation and large-scale deployment demonstrating substantial improvements in search relevance for Pinterest users worldwide.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 11:40 AM",
    "Speakers": "Mukuntha Narayanan, Han Wang",
    "Companies": "Pinterest, Inc., Pinterest",
    "Company Domains": "pinterest.com, pinterest.com",
    "Titles": "Machine Learning Engineer, Machine Learning Engineer"
  },
  {
    "Session ID": "913755",
    "Title": "Scaling AI agents without breaking reliability",
    "Description": "As AI agents move from prototypes to production, developers are running into new challenges with orchestration, failure handling, and infrastructure. This session will unpack lessons from teams already building real-world systems and share how to design for reliability from the start.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 11:55 AM",
    "Speakers": "Preeti Somal",
    "Companies": "Temporal",
    "Company Domains": "moxiegrouppr.com",
    "Titles": "Senior Vice President of Engineering"
  },
  {
    "Session ID": "915031",
    "Title": "What we can learn from self driving in autonomous voice agents",
    "Description": "The reliability challenges facing voice & chat AI deployment today mirror those that the autonomous vehicle industry confronted years ago. This talk explores how evaluation methodologies developed for self-driving cars can be transferred to create autonomous, self-improving evaluation systems for conversational AI. Drawing from my experience building evaluation infrastructure at Waymo and now developing Coval, an enterprise-grade reliability platform for conversational agents, I'll demonstrate how systematic testing infrastructure is not just a technical requirement but a competitive advantage in the rapidly evolving AI landscape.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Voice (07)",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 11:55 AM",
    "Speakers": "Brooke Hopkins",
    "Companies": "Coval",
    "Company Domains": "coval.dev",
    "Titles": "Founder"
  },
  {
    "Session ID": "915616",
    "Title": "How agents will unlock the $500B promise of AI",
    "Description": "AI agents are on the cusp of revolutionizing work as we know it. The number of use cases software can tackle is set to explode as AI handles tasks requiring real judgment. But to cross the gap between an interesting AI prototype and an essential business tool, you need agents built by developers with real guardrails and security.\r\n\r\nThis means blending AI assistance with traditional coding in a multimodal approach that maximizes efficiency and control. The future isn't about dropping in an LLM — it requires integrating any model, any data, any system to deliver results. \r\n\r\nCompanies utilizing this approach can finally turn their slice of the $500B+ of total AI investment into real business results. \r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 11:55 AM",
    "Speakers": "David Hsu",
    "Companies": "Retool ",
    "Company Domains": "retool.com",
    "Titles": "Founder and CEO"
  },
  {
    "Session ID": "915990",
    "Title": "The Rise of Open Models in the Enterprise",
    "Description": "This year kicked off with the DeepSeek-R1 news cycle breaking out of our AI Engineering bubble into the mainstream tech and business world. Leaders at the highest levels of the largest enterprises started asking how open source models could enhance and accelerate their AI strategy.\r\n\r\nOpen source models promise increased ownership of AI systems: control over performance and price, improved uptime and reliability, better compliance, and flexible hosting options. How are these promises playing out after months of implementation? In this talk, I’ll draw on hundreds of conversations with AI leaders at enterprise companies to discuss what has — and hasn’t — changed about enterprise AI strategy in a world where open-source models compete on the frontier of intelligence.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 11:55 AM",
    "Speakers": "Amir Haghighat",
    "Companies": "Baseten",
    "Company Domains": "baseten.co",
    "Titles": "CTO"
  },
  {
    "Session ID": "911846",
    "Title": "Using OSS models to build AI apps with millions of users",
    "Description": "In this talk, Hassan will go over how he builds open source AI apps that get millions of users like roomGPT.io (2.9 million users), restorePhotos.io (1.1 million users), Blinkshot.io (1 million visitors), and LlamaCoder.io (1.4 million visitors). He'll go over his journey in AI, demo some of the apps that he's built, and dig into his tech stack and code to explain how he builds these apps from scratch. He’ll also go over how to market them and go over his top tips and tricks for building great full-stack AI applications quickly and efficiently.\r\n\r\nThis talk will start from first principles and give you a glimpse into Hassan’s workflow of idea -> working app -> many users. Attendees should come out of this session equipped with the resources to build impressive AI applications and understand some of the behind the scenes of how they’re built and marketed. This will hopefully serve as an educational and inspirational talk that encourages builders to go build cool things.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Tiny Teams (01)",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Hassan El Mghari",
    "Companies": "Together AI",
    "Company Domains": "together.ai",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "914489",
    "Title": "Full Spectrum MCP: Uncovering Hidden Servers and Clients Capabilities",
    "Description": "The true power of Model Context Protocol emerges when clients and servers collaborate across the full spectrum of the specification. This talk presents practical examples of how VS Code's comprehensive implementation of MCP transforms the capabilities of AI assistants, making them more contextual, efficient, and user-friendly. We'll showcase advanced features like dynamic tool discovery and workspace-aware roots, demonstrating how they create experiences impossible with standard tools integrations while confronting the reality gap between MCP's theoretical potential and practical implementation challenges.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Harald Kirschner",
    "Companies": "Microsoft",
    "Company Domains": "microsoft.com",
    "Titles": "Principal Product Manager"
  },
  {
    "Session ID": "914548",
    "Title": "Wisdom Discovery at Scale: Code Less KAG with n8n MultiAI Agents",
    "Description": "\"Wisdom Discovery at Scale: Code Less KAG with n8n MultiAI Agents\"",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Chin Keong Lam",
    "Companies": "Patho.ai",
    "Company Domains": "gmail.com",
    "Titles": "AI Automation Engineer"
  },
  {
    "Session ID": "914975",
    "Title": "Survive the AI Knife-Fight: Building Products That Win",
    "Description": "If you’ve ever been blocked by vague specs, shifting goals, or chasing “vibes,” things have only gotten messier in the age of AI. Everyone is obsessing over engineers doing PM work and PMs cranking out prototypes—but that skips the hardest question: What should we build, and why will it win? Today’s competitive landscape is a knife-fight.  When it’s trivial to ship “something,” true differentiation becomes brutally difficult.",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Product Management (06)",
    "Room": "Foothill G 1&2: Product Management",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Brian Balfour, Brian Balfour",
    "Companies": "Reforge, Reforge",
    "Company Domains": "reforge.com, reforge.com",
    "Titles": "Founder/CEO, Founder/CEO"
  },
  {
    "Session ID": "936205",
    "Title": "360Brew LLM-based Foundation Model for Personalized Ranking and Recommendation",
    "Description": "We will give a talk about our journey of building a foundation model for solving ranking and recommendation tasks across LinkedIn platform",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Hamed Firooz, Maziar Sanjabi",
    "Companies": "LinkedIn, LinkedIn",
    "Company Domains": "gmail.com, gmail.com",
    "Titles": "Principal AI Scientist, Principal Scientist"
  },
  {
    "Session ID": "937137",
    "Title": "Large Scale AI on Apple Silicon using EXO",
    "Description": "The hardware lottery: when a research idea wins because it is better suited to current hardware and software, and not because it is universally superior.\r\n\r\nMachine learning researchers frequently regard hardware as a hard limit and halt their exploration. Yet throughout history, the decisive factor has often been which algorithm best fits the prevailing hardware-software stack - neural networks being the classic example.\r\n\r\nIn this talk, EXO Labs co-founder Alex Cheema will share recent algorithmic improvements for running large scale AI workloads on Apple Silicon.\r\n\r\nAlex will demonstrate how the EXO Framework enables inference, fine-tuning, and training of large ML models on Apple Silicon, from the scale of one MacBook locally to clusters of colocated M3 Ultra Mac Studios.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 12:05 PM",
    "Speakers": "Alex Cheema",
    "Companies": "EXO Labs",
    "Company Domains": "exolabs.net",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "915312",
    "Title": "Production software keeps breaking and it will only get worse.  Here’s how Traversal is fixing it.",
    "Description": "Software is eating the world. AI is eating software. AI-powered SWE means a whole lot more software is going to be written that powers mission critical systems in the coming years, with hardly any of it written by humans. Hence, when these software systems inevitably break, it’s going to be next to impossible to troubleshoot them. Towards addressing this issue, we’ll do a product launch of Traversal’s AI, a significant step towards self-healing software systems. We will showcase how it is already used to autonomously troubleshoot production incidents in some of the most complex enterprise environments.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Product launch",
    "Assigned Track": "SWE Agents (11)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 12:15 PM",
    "Speakers": "Anish Agarwal, Matthew Schoenbauer, Raj Agrawal, Raaz Dwivedi",
    "Companies": "Traversal, Traversal, Traversal, Traversal",
    "Company Domains": "traversal.com, traversal.com, traversal.com, interactionlabs.ai",
    "Titles": "CEO, Founding Engineer, CTO, Chief Scientist"
  },
  {
    "Session ID": "933545",
    "Title": "Mentoring the Machine",
    "Description": "You’d never let a swarm of fresh interns ship to prod on day one—same deal with AI agents. Mentoring the Machine dives into how acting like a tech lead (not just a user) turns those bots into real leverage. In this talk, Eric will deliver practical advice for working with AI agents in the SDLC. He'll also preview how effective use of AI agents changes the calculus of software engineering at both a micro and macro level.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 12:15 PM",
    "Speakers": "Eric Hou",
    "Companies": "Augment Code",
    "Company Domains": "augmentcode.com",
    "Titles": "Engineer"
  },
  {
    "Session ID": "937225",
    "Title": "3 ingredients for building reliable enterprise agents",
    "Description": "It's easy to build a prototype of an agent, but hard to put an agent in production - especially in an enterprise setting. In this section, will talk about three ingredients for building reliable agents in the enterprise.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 12:15 PM",
    "Speakers": "Harrison Chase",
    "Companies": "LangChain",
    "Company Domains": "langchain.dev",
    "Titles": "CEO"
  },
  {
    "Session ID": "937506",
    "Title": "Serving Voice AI at $1/hr: Open-source, LoRAs, Latency, Load Balancing",
    "Description": "This is a talk that goes over our experience deploying Orpheus (Emotive, Realtime TTS) to production. It will cover topics:\r\n\r\n- Latency and optimizations\r\n- High fidelity voice clones w/ examples\r\n- Load balancing w/ multiple GPUs and multiple LoRas",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 12:15 PM",
    "Speakers": "Neil Dwyer, Jack Dwyer",
    "Companies": "Gabber, Gabber",
    "Company Domains": "gabber.dev, gabber.dev",
    "Titles": "Founder, Product Marketer"
  },
  {
    "Session ID": "933549",
    "Title": "Agentic GraphRAG: AI’s Logical Edge",
    "Description": "AI models are getting tasked to do increasingly complex and industry specific tasks where different retrieval approaches provide distinct advantages in accuracy, explainability, and cost to execute. GraphRAG retrieval models have become a powerful tool to solve domain specific problems where answers require logical reasoning and correlation that can be aided by graph relationships and proximity algorithms. We will demonstrate how an agent architecture combining RAG and GraphRAG retrieval patterns can bridge the gap in data analysis, strategic planning, and retrieval to solve complex domain specific problems.\t",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 12:45 PM",
    "Speakers": "Stephen Chin",
    "Companies": "Neo4j",
    "Company Domains": "steve.chin.social",
    "Titles": "VP of Developer Relations"
  },
  {
    "Session ID": "933629",
    "Title": "How to trust an agent with software delivery",
    "Description": "AI-powered agents promise faster, easier software delivery, but their unpredictable behavior often makes engineers hesitant to fully trust them with critical workflows. Sam Alba, Co-founder of Dagger (and previously co-creator of Docker), explains how teams can reliably integrate agents into their delivery pipelines by shifting how they structure and manage automation.\r\n\r\nHe'll share four practical strategies learned from real-world experience:\r\n\r\n1. Treat agents as workflow participants, not isolated tools.\r\nStop using agents as disconnected scripts or IDE plugins. Treating them as first-class parts of your delivery process simplifies your architecture, reduces hidden complexity, and makes agent outcomes more predictable.\r\n\r\n2. Use many small agents instead of one big one.\r\nJust as software evolved from monoliths to microservices, software delivery benefits from smaller, specialized agents with clearly defined responsibilities. Smaller agents are easier to understand, maintain, and integrate.\r\n\r\n3. Define clear environments—the real lever for reliability.\r\nInstead of chasing perfect prompts or models, focus on clearly defining the tools, resources, and permissions around your agents. Precisely controlling their environments makes agents behave consistently and reliably.\r\n\r\n4. Design workflows for easy debugging and observability.\r\nAgents will sometimes fail unexpectedly. Sam will share simple, effective ways to build clear tracing and observability into your workflows from the start, making debugging quicker and less frustrating.\r\n\r\nYou'll leave with practical, immediately usable techniques that give you the confidence to trust AI agents in your software delivery pipelines.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 12:45 PM",
    "Speakers": "Sam Alba",
    "Companies": "Dagger",
    "Company Domains": "dagger.io",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "933716",
    "Title": "How fast are LLM inference engines anyway?",
    "Description": "Open weights models and open source inference servers have made massive strides in the year since we last got together at AIE World's Fair.\r\n\r\nWhere once we had only pirated LLaMA 2 weights and Transformers, we now have an embarrassment of riches. In fact, we have too many choices! What's an AI engineer looking to self-host inference to do?\r\n\r\nIn this session, we'll share our benchmarking results from hundreds of runs across models, frameworks, and hardware. We'll also share tips and tricks from working with teams deploying LLM inference at scale.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 12:45 PM",
    "Speakers": "Charles Frye",
    "Companies": "Modal Labs",
    "Company Domains": "modal.com",
    "Titles": "LLM Engineer"
  },
  {
    "Session ID": "933621",
    "Title": "Effective agent design patterns in production",
    "Description": "At LlamaIndex we see a lot of agents built every day, and we've got a sense of what works and what doesn't. We've distilled those learnings down into a series of patterns and best practices for building real-world, production agents, and we're here to share them. You'll learn patterns for applying structure and guidance to famously nondeterministic LLMs and get concrete instruction on how to implement them.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 01:05 PM",
    "Speakers": "Laurie Voss",
    "Companies": "LlamaIndex",
    "Company Domains": "llamaindex.ai",
    "Titles": "VP Developer Relations"
  },
  {
    "Session ID": "933652",
    "Title": "Events are the Wrong Abstraction for Your AI Agents",
    "Description": "AI Agents are distributed systems. Agents need to connect and communicate with tools, data repositories, other agents, etc., all over a network. Event-Driven Architecture is a common pattern for facilitating this connectivity, using Events as the communication abstraction. However, this pattern introduces complexities as well, such as fragmented logic, increased latency, decreased observability, and more. But what if there were a way to get the benefits of Event-Driven Architecture without the complexities? Enter Durable Execution. In this talk, we'll discuss the pitfalls of Event-Driven Architecture, how Durable Execution solves these issues, and why Durable Execution, not Events, is the correct abstraction for building AI Agents.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 01:05 PM",
    "Speakers": "Mason Egger",
    "Companies": "Temporal Technologies",
    "Company Domains": "temporal.io",
    "Titles": "Senior Developer Advocate"
  },
  {
    "Session ID": "933669",
    "Title": "\"Data readiness\" is a myth: Make AI Reliabile with an Agentic Semantic Layer",
    "Description": "The rapid progress in LLM capability has not translated to increased reliability for business critical AI use cases. The root-cause? Data is \"not ready\".\r\nConversational analytics doesn't go beyond the analyst team because it's hard to verify if the generated queries are actually doing what they are supposed to.\r\nRAG based systems often fail to handle the breadth and depth of real world use-cases because it requires a prohibitive amount of preparation & maintenance of an underlying knowledge graph.\r\n\r\nAgentic AI systems need to hard-code specific workflows to work reliably and end up looking more like software engineering with LLM calls instead of delivering on the promise of truly agentic workflows.\r\n\r\nIn all of these failure modes, the common culprit is that the planning or reasoning done by the LLM fails to accurately capture the user's intent or the domain's context aka the lack of a well prepared semantic data layer.\r\n\r\nEnterprise data is silo-ed and vastly varying levels of quality and the perfect \"semantic layer\" and \"metadata\" is a moving target. New data is continuously being created and business definitions are rapidly changing and often entirely on-demand.\r\nIn this talk we'll share how you can build and maintain a semantic data layer that is maintained entirely by AI, and show (with live examples) how that dramatically improves reliability of the AI system that needs dynamic access to data.\r\nWe'll demonstrate how this sufficiently augments existing RAG, text-to-SQL and tool calling techniques and starts opening the door to reliable AI deployments.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 01:05 PM",
    "Speakers": "Anushrut Gupta",
    "Companies": "Hasura",
    "Company Domains": "hasura.io",
    "Titles": "Applied AI Lead"
  },
  {
    "Session ID": "933605",
    "Title": "Data is Your Differentiator: Building Secure and Tailored AI Systems",
    "Description": "As  organizations seek to harness their proprietary data while maintaining  security and compliance, Amazon Bedrock provides a comprehensive framework  for building tailored AI applications. Using Amazon Bedrock Knowledge Bases  and Amazon Bedrock Data Automation, organizations can create AI solutions  that truly understand their unique business context, terminology, and  requirements. Combined with Amazon Bedrock Guardrails, these capabilities  enhance the accuracy and relevance of AI-generated responses, while ensuring  that sensitive information remains protected within the organization's  control - enabling businesses to build secure and compliant enterprise-grade  generative AI solutions that accelerate time to value.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 01:25 PM",
    "Speakers": "Mani Khanuja",
    "Companies": "AWS",
    "Company Domains": "aws.amazon.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "933641",
    "Title": "Revenue Engineering: How to Price (and Reprice) Your AI Product",
    "Description": "You’ve trained the model—now it’s time to train the business. This talk dives into the engineering behind pricing systems that can evolve as fast as your AI stack.\r\n\r\nOrb CTO Kshitij Grover will walk through how leading AI companies design infrastructure to support experimentation, scale, and real-world monetization constraints.\r\n\r\nTopics include:\r\n- How to meter usage and map it to pricing with accuracy and auditability\r\n- Factoring in margins and underlying costs when designing pricing strategy\r\n- Handling complexity across motions: self-serve vs. enterprise, pay-as-you-go vs. committed contracts\r\n- How to test pricing changes safely (and roll them back when needed)\r\n\r\nWhether you’re bootstrapping a pricing system from scratch or replacing a brittle V1, you’ll leave with architectural patterns and mental models to make pricing a first-class engineering concern.\r\n",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 01:25 PM",
    "Speakers": "Kshitij  Grover",
    "Companies": "Orb",
    "Company Domains": "orb.com",
    "Titles": "CTO"
  },
  {
    "Session ID": "911925",
    "Title": "MCP is all you need",
    "Description": "Everyone is talking about agents, and right after that, they’re talking about agent-to-agent communications. Not surprisingly, various nascent, competing protocols are popping up to handle it.\r\n\r\nBut maybe all we need is MCP — the OG of GenAI communication protocols (it's from way back in 2024!).\r\n\r\nLast year, Jason Liu gave the second most watched AIE talk — “Pydantic is all you need”.\r\n\r\nThis year, I (the creator of Pydantic) am continuing the tradition by arguing that MCP might be all we need for agent-to-agent communications.\r\n\r\nWhat I’ll cover:\r\n\r\n- Misusing Common Patterns: MCP was designed for desktop/IDE applications like Claude Code and Cursor. How can we adapt MCP for autonomous agents?\r\n- Many Common Problems: MCP is great, but what can go wrong? How can you work around it? Can the protocol be extended to solve these issues?\r\n- Monitoring Complex Phenomena: How does observability work (and not work) with MCP?\r\n- Multiple Competing Protocols: A quick run-through of other agent communication protocols like A2A and AGNTCY, and probably a few more by June 😴\r\n- Massive Crustaceans Party: What might success look like if everything goes to plan?",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Samuel Colvin",
    "Companies": "Pydantic Inc.",
    "Company Domains": "pydantic.dev",
    "Titles": "Founder"
  },
  {
    "Session ID": "915338",
    "Title": "How to build Enterprise-aware agents",
    "Description": "While LLMs demonstrated impressive reasoning capabilities, their out-of-the-box reasoning is akin to hiring a brilliant but brand-new employee who doesn’t have the enterprise context of “how things are done at this company”. In this talk, I'll introduce “Workflow Search” as a paradigm to build enterprise-aware agents that can balance predictability on common tasks, and flexibility on unforeseen tasks.\r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Agent Reliability (04)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Chau Tran, Chau Tran",
    "Companies": "Glean, Glean",
    "Company Domains": "gmail.com, gmail.com",
    "Titles": "Software Engineer, Software Engineer"
  },
  {
    "Session ID": "915648",
    "Title": "Shipping Products When You Don’t Know What they Can Do",
    "Description": "A customer recently asked me: “Hey, can I tag your AI agent in a Google Doc comment?”\r\n\r\nThe honest answer: I have no idea! We never designed our agents to handle Google Doc comments, but we tried it anyway… and it worked! The agent performed beautifully, the customer was thrilled, and I was left bewildered.\r\n\r\nWelcome to Product Management for AI agents, where roadmaps are fuzzy and we only learn the boundaries of our products after they’re released. When a product doesn’t follow predefined requirements but instead learns and improvises at runtime, PMs must give up control and lean into uncertainty, curiosity, experimentation, and fast feedback loops.\r\n\r\nThis talk is a field guide for Product/Engineering teams navigating this new reality. We’ll cover how to write specs for affordances instead of features, how to use AI evals as a product development tool, and how to perform User Acceptance Testing on undocumented emergent behavior. Most importantly, we’ll explore how to build trust with customers even when the answer is, truthfully, “I don’t know.”\r\n\r\nIf you’re managing AI-native products in 2025 the same way you managed web apps in 2020, you might find yourself A/B testing an agent that decided to go off and do C, D, and E all by themselves!\r\n",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Product Management (06)",
    "Room": "Foothill G 1&2: Product Management",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Ben Stein",
    "Companies": "Teammates",
    "Company Domains": "teammates.work",
    "Titles": "Product Leader"
  },
  {
    "Session ID": "915740",
    "Title": "Practical GraphRAG - Making LLMs smarter with Knowledge Graphs",
    "Description": "RAG has become one standard architecture component for GenAI applications to address hallucinations and integrate factual knowledge. While vector search over text is common, knowledge graphs represent a proven advancement by leveraging advanced RAG patterns to access and integrate interconnected factual information, complementing the language skills of LLMs. This talk explores GraphRAG challenges, implementation patterns, and real-world agentic examples with Google's ADK, demonstrating how this approach delivers more trustworthy and explainable GenAI solutions with enhanced reasoning capabilities.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Michael Hunger, Jesús Barrasa, Stephen Chin",
    "Companies": "Neo4j, Neo4j, Neo4j",
    "Company Domains": "neotechnology.com, neo4j.com, steve.chin.social",
    "Titles": "Head of Product Innovation and GenAI, AI Field CTO, VP of Developer Relations"
  },
  {
    "Session ID": "916079",
    "Title": "Building the Voice-First Future: Omnipresent Agents that Listen, Talk and Act",
    "Description": "We’re entering a world where talking to machines feels as natural as talking to people. Voice is about to become the dominant interface for technology - ambient, always-on, and human by default. To get there, we need infrastructure that can orchestrate voice, tools, memory, real-time reasoning and telephony. This talk explores the vision for voice and how we're making it work at scale. ",
    "Session Format": "Talk",
    "Level": "Expert",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Voice (07)",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Jordan Dearsley",
    "Companies": "Vapi",
    "Company Domains": "vapi.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "916157",
    "Title": "AI That Pays: Lessons from Revenue Cycle",
    "Description": "While much of the AI innovation in healthcare has centered on clinical and patient-facing applications, Revenue Cycle Management (RCM) remains an underexplored yet critical domain. Given the growing financial pressures facing providers, rethinking how healthcare gets paid is essential to ensuring access and sustainability. The combination of which makes RCM an opportune area for AI disruption.\r\n\r\nThis session explores how the combination of vast structured and unstructured data, often rule-based workflows, and direct financial opportunity to drive meaningful outcomes. We’ll also share practical lessons from our journey evolving a traditional machine learning mindset to incorporate the latest advances in Generative AI, and how that shift is reshaping what's possible in healthcare operations.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Nathan Wan",
    "Companies": "Ensemble Health Partners",
    "Company Domains": "ensemblehp.com",
    "Titles": "machine learning and engineering leader"
  },
  {
    "Session ID": "923914",
    "Title": "Tiny Teams",
    "Description": "Sean reached out on X, happy to do a talk on how to build a tiny team",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Tiny Teams (01)",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Grant Lee",
    "Companies": "Gamma",
    "Company Domains": "gamma.app",
    "Titles": "Founder"
  },
  {
    "Session ID": "928676",
    "Title": "[Infra Keynote] Geopolitics of AI Infrastructure",
    "Description": "As AI reshapes the global balance of power, the infrastructure behind it—chips, data centers, power, and supply chains—has become a new arena for geopolitical competition. This talk explores how nations are racing to secure critical AI hardware, control compute capacity, and assert influence over the technologies and talent that define the future.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Dylan Patel",
    "Companies": "SemiAnalysis",
    "Company Domains": "semianalysis.com",
    "Titles": "Founder and CEO"
  },
  {
    "Session ID": "932429",
    "Title": "Building an Agentic Platform",
    "Description": "Explore the technical evolution of metadata extraction at Box and how it shaped the foundation of our AI platform. We’ll walk through our transition to an agentic-first design—why it was necessary, how we approached the rebuild, challenges we encountered along the way, and the advantages it unlocked.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Ben Kus",
    "Companies": "Box",
    "Company Domains": "box.com",
    "Titles": "CTO"
  },
  {
    "Session ID": "932583",
    "Title": "One model to rule recommendations: Netflix's Big Bet",
    "Description": "Discuss the foundation model strategy for personalization at Netflix based on this post https://netflixtechblog.com/foundation-model-for-personalized-recommendation-1a0bd8e02d39 and recent developments. ",
    "Session Format": "Talk",
    "Level": "Expert",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 02:00 PM",
    "Speakers": "Yesu Feng",
    "Companies": "Netflix",
    "Company Domains": "netflix.com",
    "Titles": "Staff Research Scientist/Engineer"
  },
  {
    "Session ID": "904822",
    "Title": "Structuring a modern AI team",
    "Description": "You've been given an AI mandate but don't have additional headcount, what next? Re-skilling, up-skilling and team augmentation become essential to delivering on a new mandate. In this talk we'll cover strategies to structure cross functional AI teams with domain experts, software engineers and ML engineers. We'll cover key skills and milestones that each traditional role can contribute to in unique ways.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Denys Linkov",
    "Companies": "Wisedocs",
    "Company Domains": "gmail.com",
    "Titles": "Head of ML"
  },
  {
    "Session ID": "914015",
    "Title": "Agents vs Workflows: Why Not Both?",
    "Description": "One current hot debate is should you make your top-level abstraction a ReAct type agent running in a loop? or should you make it a structured workflow graph?\r\n\r\nOpenAI is launching their new framework and throwing shade on workflow graph approaches\r\n\r\nTBH we think this whole debate is kinda dumb. \r\n\r\nWe've seen a lot of folks be able to structure the problem in a way that a workflow graph makes a lot of sense. \r\n\r\nWe also see a ton of agents where you need to run the core bit in a loop for a long time.\r\n\r\nYou can also give your agents structured workflow graphs as a tool. You can use structured workflow graphs as a handoff mechanism between agents. What we've seen from the community is frankly that folks need to tinker with multiple approaches and combine primitives in interesting ways\r\n\r\nWe'll share a couple stories where teams ended up with workflow graph based approaches, a couple where teams ended up with agent based approaches, and a couple where a blended approach made sense.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Agent Reliability (04)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Sam Bhagwat",
    "Companies": "Mastra",
    "Company Domains": "gmail.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "914890",
    "Title": "The Billable Hour is Dead; Long Live the Billable Hour?",
    "Description": "If software was eating the world before, knowledge work will soon be devoured by AI. In corporate America there are thousands of hours spent on rote tasks every day by employees, consultants, and lawyers alike. But is AI really capable of replacing work in the real world yet? \r\nProductivity estimates from GenAI range from 1.5% (NBER) to 96% (☝ us! ️). In this talk we'll share war stories of where the answer is yes (and no) and how we reduced human time spent on tasks from days to minutes in high-impact situations. \r\nThe path from promise to actual product, used in real world settings, from our experience, is still unmapped. Learn what we built, how we built it - with code - and how we got stakeholder buy-in to deploy it.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Kevin Madura, Mo Bhasin",
    "Companies": "AlixPartners, AlixPartners",
    "Company Domains": "alixpartners.com, gmail.com",
    "Titles": "Technical Advisor, Director of AI Products"
  },
  {
    "Session ID": "915013",
    "Title": "Observable tools - the state of MCP observability",
    "Description": "AI Engineers deserve observable tools! \r\n\r\nMCP getting adoption means that less and less of your agents code is running under your control, and this has DX and observability challenges, let's fix that! \r\n\r\nJoin Alex Volkov from Weights & Biases and Steve Manual from mcp.run on this recap of the current state of MCP observability, including the observable.tools initiative, a recap of where the field stands and what to look forward to + a practical example of MCP tool usage evaluation framework from mcp.run! ",
    "Session Format": "Talk",
    "Level": "Expert",
    "Scope": "Technical deep dive",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Alex Volkov, Steve Manuel, Benjamin Eckel",
    "Companies": "Weights & Biases, Dylibso, Dylibso",
    "Company Domains": "gmail.com, dylibso.com, dylibso.com",
    "Titles": "AI Evangelist, CEO, CTO"
  },
  {
    "Session ID": "915471",
    "Title": "Hacking the Inference Pareto Frontier for Cheaper and Faster Tokens Without Breaking SLAs",
    "Description": "Your model works! It aces the evals! It even passes the vibe check! All that’s required is inference, right? Oops, you’ve just stepped into a minefield:\r\n\r\n-Not low-latency enough? Choppy experience. Users churn from your app. \r\n-Not cheap enough? You’re losing money on every query.\r\n-Not high enough output quality? Your system can’t be used for that application.\r\n\r\nA model and the inference system around it form a “token factory” associated with a Pareto frontier— a curve representing the best possible trade-offs between cost, throughput, latency and quality, outside of which your LLM system cannot be applied successfully. \r\n\r\nOutside of the Pareto frontier? You’re back to square one.\r\nThat is, unless you’re able to change the shape of the Pareto frontier.\r\n\r\nIn this session, we’ll introduce NVIDIA Dynamo, a datacenter-scale distributed inference framework as well as the bleeding-edge techniques it enables to hack the Pareto frontier of your inference systems, including:\r\n\r\n-Disaggregation - separating phases of LLM generation to make them more efficient\r\n-Speculation - predicting multiple tokens per cycle\r\n-KV routing, storage, and manipulation - ensuring that we don’t redo work that has already been done\r\n-Pipelining improvements for agents - accelerating our workflows using information about the agent\r\n\r\nBy the end of the talk, we’ll understand how the Pareto frontier limits where models can be applied, the intuition behind how inference techniques can be used to modify it, as well as the mechanics of how these techniques work.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Kyle Kranen US",
    "Companies": "NVIDIA",
    "Company Domains": "nvidia.com",
    "Titles": "Engineering Leader"
  },
  {
    "Session ID": "915738",
    "Title": "Make your LLM app a Domain Expert: How to Build an LLM-Native Expert System",
    "Description": "Vertical AI is a multi-trillion-dollar opportunity. But you can't build a domain-expert application simply by grabbing the latest LLMs off-the-shelf: you need a system for codifying latent insights from domain experts and using that to drive development of your application.\r\n\r\nIn this talk, we'll describe the system we've built at Anterior which has enabled us to achieve SOTA clinical reasoning and serve health insurance providers covering 50 million American lives. We'll share:\r\n- how and why to encode domain-specific failure modes as an ontology\r\n- a practical system for converting domain expertise into quantifiable eval metrics\r\n- how we structure work and collaboration between our clinicians, engineer and PMs\r\n- our eval-driven AI iteration process and how this can be adapted to any industry",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Product Management (06)",
    "Room": "Foothill G 1&2: Product Management",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Christopher Lovejoy",
    "Companies": "Anterior ",
    "Company Domains": "anterior.com",
    "Titles": "Head of Clinical AI"
  },
  {
    "Session ID": "915992",
    "Title": "HybridRAG: A Fusion of Graph and Vector Retrieval to Enhance Data Interpretation",
    "Description": "Interpreting complex information from unstructured text data poses significant challenges to Large Language Models (LLM), with difficulties often arising from specialized terminology and the multifaceted relationships between entities in document architectures. Conventional Retrieval Augmented Generation (RAG) methods face limitations in capturing these nuanced interactions, leading to suboptimal performance. In our talk, we introduce a novel approach integrating Knowledge Graph-based RAG (GraphRAG) with VectorRAG, designed to refine question-answering (Q&A) systems for more effective information extraction from complex texts. Our approach employs a dual retrieval strategy that harnesses both knowledge graphs and vector databases, enabling the generation of precise and contextually appropriate answers, thereby setting a new standard for LLMs in processing sophisticated data.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Mitesh Patel",
    "Companies": "NVIDIA",
    "Company Domains": "nvidia.com",
    "Titles": "Developer Advocate Manager"
  },
  {
    "Session ID": "929231",
    "Title": "Instacart’s LLM-driven approach to Search and Discovery",
    "Description": "",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "LLM RecSys (03)",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Tejaswi Tenneti, Vinesh Gudla",
    "Companies": "Instacart, Instacart",
    "Company Domains": "instacart.com, instacart.com",
    "Titles": "Director of Machine Learning, Staff Machine Learning Engineer"
  },
  {
    "Session ID": "932493",
    "Title": "Why ChatGPT Keeps Interrupting You",
    "Description": "ChatGPT Advanced Voice Mode isn’t interrupting just you. Interruptions, and turn-taking in general, are unsolved problems for all Voice AI agents. Nobody likes being cut short – and people have much less patience for machines than they do for other humans. Turn-taking failures take many forms (e.g., the agent interrupts the user, the agent mistakes a cough for an interruption), and all of them lead to users immediately hanging up the phone.\r\n\r\nIn this talk, we use human conversation as a framework for understanding both today’s approaches to turn detection and where the field is headed. You’ll learn about how linguists think about turn detection in human dialogue, what’s working (and what’s broken) in current methods, and how we might build Voice AIs that interrupt you less than your human brother. ",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Tom Shapland, PhD",
    "Companies": "LiveKit",
    "Company Domains": "livekit.io",
    "Titles": "Product Manager"
  },
  {
    "Session ID": "939097",
    "Title": "Building Small AI Teams with Huge Impact",
    "Description": "tbd",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 02:25 PM",
    "Speakers": "Vik Paruchuri",
    "Companies": "Datalab",
    "Company Domains": "datalab.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "906567",
    "Title": "Teaching Gemini to Speak YouTube: Adapting LLMs for Video Recommendations to 2B+ DAU",
    "Description": "YouTube recommendations drive nearly two-thirds of the platform's staggering 5 billion daily watch hours for 2 billion+ DAU. Traditionally powered by large embedding models (LEMs), we're undertaking a fundamental shift: rebuilding our recommendation stack using foundation models like Gemini. This talk dives into our engineering journey adapting general-purpose LLMs (Gemini) for the highly specialized, dynamic, and massive-scale task of YouTube recommendations.\r\n\r\nWe'll start with a critical first step: creating a \"language\" for YouTube videos. Learn how we developed 'SemanticID', a novel tokenization scheme that distills multimodal video features (text, audio, frames) into discrete tokens representable by an LLM. Our paper (Better Generalization with Semantic IDs: A Case Study in Ranking for Recommendations) is a landmark work in this space.  \r\n\r\nWe then adapt the base Gemini checkpoint to understand sequences of these video tokens alongside natural language, effectively teaching it the grammar of user watch behavior. A key insight: unlike static LLM training, YouTube's corpus evolves so rapidly (millions of new videos daily) that daily retraining is non-negotiable to maintain recommendation quality.\r\n\r\nNow we can prompt LRM with user history and context to generate personalized candidate recommendations, achieving the biggest engagement wins on YouTube in the last ~decade. \r\n\r\nThere’s a lot of attention on the LLM-led transformation of Search (with AI Overviews, Perplexity, ChatGPT-Search etc). However, across large consumer apps, it’s the recommendation systems & feeds that drive most consumer engagement, not just search (eg. YouTube recs drive 67% of WatchTime). This talk is about the LLM-led transformation of recommendations & feeds – building a recommendation engine on top of Gemini.\r\n",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "LLM RecSys (03)",
    "Room": "Golden Gate Ballroom A: LLM RecSys",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Devansh Tandon",
    "Companies": "Google",
    "Company Domains": "gmail.com",
    "Titles": "Principal Product Manager"
  },
  {
    "Session ID": "912986",
    "Title": "Flipping the Inference Stack: Why GPUs Bottleneck Real-Time AI at Scale",
    "Description": "AI inference today is stuck in a loop: throw more GPUs at the problem, scale horizontally, rinse and repeat. But that playbook is hitting a wall. Latency, cost, and energy grids are all suffering, and the capability for real-time AI at scale looks further and further away. In this talk, AI hardware expert and founder Gavin Uberti will break down why the current approach to inference is masking deep inefficiencies, and how rethinking the hardware stack from the ground up (starting with inference-first chips) is the only way to unlock real-time AI at scale. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "Foothill F: Infrastructure",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Robert  Wachen",
    "Companies": "Etched",
    "Company Domains": "etched.com",
    "Titles": "COO"
  },
  {
    "Session ID": "915067",
    "Title": "Building Effective Voice Agents",
    "Description": "How to build production voice applications and learnings from working with customers along the way",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Anoop Kotha",
    "Companies": "OpenAI",
    "Company Domains": "openai.com",
    "Titles": "Customer Solutions Engineer"
  },
  {
    "Session ID": "915770",
    "Title": "From Hunch to Handoff: How AI PMs Can Help Turn Ideas Into Shippable Features Quickly",
    "Description": "\"We should add AI to this!\" Great, but how do you know if your idea will actually work? The gap between AI concept and engineering reality is where most promising features die.\r\nIn this talk, we will reveal a rapid validation framework developed through working with dozens of product teams—including within Workday's AI product efforts. We'll share a three-step process that starts with lightweight prototyping, builds a relevant evaluation suite, and creates the right artifacts for successful engineering handoffs. You'll see how leading teams use this approach to explore what's possible, establish practical quality benchmarks, and align cross-functional stakeholders before writing a single line of production code.\r\nEliza Cabrera (Principal PM, Workday) and Jeremy Silva (Product Lead, Freeplay) will share the playbook they use to turn “we should add AI here” hunches into AI features customers actually use and trust.\r\nAttendees will leave with a field‑tested framework, real examples from enterprise teams, and ready‑to‑use templates that let AI PMs guide ideas from first spark to successful release—cheaply, quickly, and with confidence.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Jeremy Silva, Eliza Cabrera",
    "Companies": "Freeplay, Workday",
    "Company Domains": "freeplay.ai, airockies.com",
    "Titles": "Product Lead, Principal PM"
  },
  {
    "Session ID": "915974",
    "Title": "Benchmarks Are Memes: How What We Measure Shapes AI—and Us",
    "Description": "Benchmarks shape more than just AI models—they shape our future. The things we choose to measure become self-fulfilling prophecies, guiding AI toward specific abilities and, ultimately, defining humanity’s evolving role in the AI era. Today’s benchmarks have propelled incredible progress, but now we have an exciting opportunity: thoughtfully designing benchmarks around what genuinely matters to us—cooperation, creativity, education, and meaningful human experiences.\r\n\r\nIn this talk, we’ll explore how benchmarks function as powerful cultural memes, influencing not only technical outcomes but societal direction. Drawing on practical examples we have seen at Every consulting in industries like finance, journalism, education, and even personally making AI play diplomacy. We’ll uncover what makes a benchmark impactful, approachable, and inspiring. You’ll see our engaging new AI Diplomacy benchmark demo, illustrating vividly how thoughtful evaluation design can excite both engineers and the wider community.\r\n\r\nYou’ll hopefully walk away inspired and equipped to define benchmarks intentionally, helping steer AI toward outcomes that truly matter.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI Architects (L1)",
    "Room": "Yerba Buena Ballroom Salons 2-6: Tiny Teams",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Alex Duffy",
    "Companies": "Every Inc.",
    "Company Domains": "every.to",
    "Titles": "AI Strategy Lead"
  },
  {
    "Session ID": "916063",
    "Title": "Multi-Agent AI and Network Knowledge Graphs for Change Management and Network Testing",
    "Description": "Traditional ticketing and testing workflows for change management and network operations often operate independently and lack critical real-world context and adaptive decision making capabilities. This fragmented approach results in delayed resolutions, repeated incidents, escalations, and dissatisfied stakeholders.\r\n\r\nThis session explores an innovative solution leveraging the synergy of natural language processing from IT Service Management (ITSM) systems, Multi-agent reasoning, and dynamic context derived from live knowledge network graphs. Attendees will gain insights into an end-to-end architecture where natural language intents from ITSM tickets seamlessly integrate with experts AI agents for complex workflow tasks, supported by continuous network knowledge graph ingestion pipelines.\r\n\r\nThrough a detailed production case study, we will demonstrate how Agentic reasoning combined with dynamic network knowledge graph contexts significantly improves critical validation and workflow interactions. The showcased results will highlight dramatic improvements in ticket resolution efficiency, accuracy of network testing, and overall execution quality, delivering tangible value to both technical teams and business stakeholders.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "GraphRAG (08)",
    "Room": "Golden Gate Ballroom B: GraphRAG",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Ola  Mabadeje",
    "Companies": "Cisco",
    "Company Domains": "cisco.com",
    "Titles": "Leader, Generative AI Incubation"
  },
  {
    "Session ID": "916115",
    "Title": "Vibe Coding, with Confidence",
    "Description": "Everyone wants to do Vibe Code, even large Enterprises. But how can we ensure that the generated code is well-grounded with the dev team's code and software development standards? In this talk, Itamar will present how to use various tools and agents, including MCP and A2A, to achieve precisely that.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Product launch",
    "Assigned Track": "Agent Reliability (04)",
    "Room": "Foothill C: Agent Reliability",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Itamar Friedman",
    "Companies": "Qodo",
    "Company Domains": "qodo.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "926313",
    "Title": "The rise of the agentic economy on the shoulders of MCP",
    "Description": "Thanks to MCP and all the MCP server directories, agents can now autonomously discover new tools and other agents. This lays down the foundation for the future agentic economy, where businesses will sell to autonomous agents (B2A) and eventually agents will sell to other agents (A2A).\r\n\r\nBut one key part is still missing: agents do not have a standard way to subscribe to external services and pay for them.\r\n\r\nIn this talk, we’ll show how to give agents full autonomy to discover and pay for new external MCP-enabled services, even if those services don’t support it, using a little-known MCP server nesting capability. We’ll also cover how to monetize AI agents and the B2A/A2A business models.\r\n",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "MCP (02)",
    "Room": "Yerba Buena Ballroom Salons 7-8: MCP",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Jan Curn",
    "Companies": "Apify",
    "Company Domains": "apify.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "933596",
    "Title": "Milliseconds to Magic: Real‑Time Workflows using the Gemini Live API and Pipecat",
    "Description": "The Gemini Live API GA  is now powered by Google's best cost-effective thinking model Gemini 2.5 Flash. We will do a deep dive on the capabilities that the Gemini Live API combined with Pipecat unlock for devs with special focus on session management, turn detection, tool use (including async function calls), proactivity, multilinguality and integration with telephony and other infra. We will demo some of the more innovative capabilities. We will also talk through some customer use cases - especially how customers can use Pipecat to extend these realtime multimodal capabilities to client side applications such as customer support agents, gaming agents, tutoring agents etc. In addition, we also have an experimental version of the Live API powered by with Google's native audio offering that can be tried in an experimental capacity . This experimental model  can communicate with seamless, emotive, steerable, multilingual dialogue and enhances use cases where more natural voices can be a big differentiator. ",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Foothill E: Voice",
    "Scheduled At": "4 Jun 2025 02:50 PM",
    "Speakers": "Kwindla Kramer",
    "Companies": "Daily",
    "Company Domains": "daily.co",
    "Titles": "Engineer"
  },
  {
    "Session ID": "933618",
    "Title": "Conquering Agent Chaos",
    "Description": "Agent deployments can be dicey, especially at first.  This session goes over all the things that cause headache with deployments from serverless issues to networking issues - and how we fix them.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Product launch",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "4 Jun 2025 03:15 PM",
    "Speakers": "Rick Blalock",
    "Companies": "unknown",
    "Company Domains": "agentuity.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "933625",
    "Title": "Vector Search Benchmark[eting]",
    "Description": "Every vector database out there is both faster and slower than any other competitor — if you believe all the benchmarketing out there.\r\nLet's turn the marketing into useful benchmarks that actually help you:\r\n1. How not to benchmark (spoiler: don’t trust the glossy charts).\r\n2. What’s uniquely tricky about benchmarking vector search.\r\n3. How to build meaningful benchmarks tailored to your use case.\r\n\r\nPS: Yes, you will have to get your hands dirty. Never believe a benchmark that you haven't tweaked yourself.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "4 Jun 2025 03:15 PM",
    "Speakers": "Philipp Krenn",
    "Companies": "Elastic",
    "Company Domains": "xeraa.net",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "936894",
    "Title": "Taming Rogue AI Agents with Observability-Driven Evaluation",
    "Description": "LLM agents often drift into failure when prompts, retrieval, external data, and policies interact in unpredictable ways. This session introduces a repeatable, metric-driven framework for detecting, diagnosing, and correcting these undesirable behaviors in agentic systems at production scale.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "4 Jun 2025 03:15 PM",
    "Speakers": "Jim Bennett",
    "Companies": "Galileo",
    "Company Domains": "mac.com",
    "Titles": "Principal Developer Advocate"
  },
  {
    "Session ID": "933612",
    "Title": "Building  Agents at Cloud-Scale",
    "Description": "Let's explore  practical strategies for building and scaling agents in production. Discover  how to move from local MCP implementations to cloud-scale architectures and  how engineering teams leverage these patterns to develop sophisticated agent  systems. Expect a mix of demos, use case discussions, and a glimpse into the  future of agentic services!",
    "Session Format": "Keynote",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 04:00 PM",
    "Speakers": "Antje Barth",
    "Companies": "AWS",
    "Company Domains": "amazon.com",
    "Titles": "Principal Developer Advocate"
  },
  {
    "Session ID": "933675",
    "Title": "Windsurf everywhere, doing everything, all at once",
    "Description": "abstract tbd",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 04:20 PM",
    "Speakers": "Kevin Hou",
    "Companies": "Windsurf",
    "Company Domains": "windsurf.com",
    "Titles": "Head of Product Engineering"
  },
  {
    "Session ID": "936006",
    "Title": "#define AI Engineer",
    "Description": "Greg Brockman's career and advice for AI Engineers",
    "Session Format": "",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "4 Jun 2025 04:40 PM",
    "Speakers": "Greg Brockman, swyx .",
    "Companies": "OpenAI, unknown",
    "Company Domains": "openai.com, unknown",
    "Titles": "CTO, unknown"
  },
  {
    "Session ID": "935461",
    "Title": "A year of Gemini progress + what comes next",
    "Description": "Over the last year, Google and Gemini models have shown rapid progress across all dimensions (model, product, etc). Let's highlight all the work that has happened, how we got the worlds best models, and where we are going next (across both the model landscape and out AI products).",
    "Session Format": "Keynote",
    "Level": "Introductory and overview",
    "Scope": "Case Study/War Story",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 09:05 AM",
    "Speakers": "Logan Kilpatrick",
    "Companies": "Google",
    "Company Domains": "gmail.com",
    "Titles": "Product Lead"
  },
  {
    "Session ID": "936022",
    "Title": "Jack Rae Keynote",
    "Description": "",
    "Session Format": "Keynote",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 09:25 AM",
    "Speakers": "Jack Rae",
    "Companies": "unknown",
    "Company Domains": "unknown",
    "Titles": "unknown"
  },
  {
    "Session ID": "916116",
    "Title": "Containing Agent Chaos",
    "Description": "AI agents promise breakthroughs but often deliver operational chaos. Building reliable, deployable systems with unpredictable LLMs feels like wrestling fog – testing outputs alone is insufficient when the underlying workflow is opaque and flaky. How do we move beyond fragile prototypes?\r\n\r\nThis talk, from the creator of Docker, argues the solution lies *outside* the model: engineering **reproducible execution workflows** built on rigorous architectural discipline. Learn how **containerization**, applied not just to deployment but to *each individual step* of an agent's workflow, provides the essential **isolation and environmental consistency** needed.\r\n\r\nDiscover how combining this granular container approach with patterns like immutable state management allows us to **contain agent chaos**, unlock effective testing, simplify debugging, and bring essential control and predictability back to building powerful AI agents you can actually ship with confidence.",
    "Session Format": "Keynote",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 09:50 AM",
    "Speakers": "Solomon Hykes",
    "Companies": "Dagger",
    "Company Domains": "dagger.io",
    "Titles": "Founder and CEO"
  },
  {
    "Session ID": "916189",
    "Title": "The infrastructure for the singularity",
    "Description": "We're at an inflection point where AI agents are transitioning from experimental tools to practical coworkers. This new world will demand new infrastructure for RL training, test-time scaling, and deployment. This is why Morph Labs developed Infinibranch last year, and we are excited to finally unveil what's next.",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Product launch",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 10:10 AM",
    "Speakers": "Jesse Han",
    "Companies": "Morph Labs",
    "Company Domains": "morph.so",
    "Titles": "Founder and CEO"
  },
  {
    "Session ID": "933462",
    "Title": "The fastest software dev workflow in the world: AI meets stacked diffs",
    "Description": "Learn the secrets behind the workflows that engineers at the fastest moving companies in the world are using to build software for billions of users worldwide. This workshop will cover a comprehensive overview of how to leverage generative AI to write code, how to stack and submit these pull requests, and finally how to use AI to review them.",
    "Session Format": "Workshop",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 10:45 AM",
    "Speakers": "Kenneth DuMez",
    "Companies": "Graphite",
    "Company Domains": "graphite.com",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "933603",
    "Title": "Introducing Strands Agents, an Open Source AI Agents SDK",
    "Description": "Building AI agents used to require complex orchestration, extensive scaffolding, and months of tuning. With Strands Agents, an open source SDK from AWS. You can now build, test, and deploy intelligent agents in just a few lines of code. This session introduces the model-driven approach behind Strands, where a model, a prompt, and a set of tools are all you need to create powerful, production-ready agents. Learn how Strands leverages modern foundation models to handle reasoning, tool use, and reflection, reducing development time from months to days.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "5 Jun 2025 10:45 AM",
    "Speakers": "Suman Debnath",
    "Companies": "Amazon Web Services",
    "Company Domains": "aws.amazon.com",
    "Titles": "Principal Developer Advocate"
  },
  {
    "Session ID": "933646",
    "Title": "Why Your Agent’s Brain Needs a Playbook: Practical Wins from Using Ontologies",
    "Description": "You're trying to guide how your agents think and act. Code-orchestrated workflows are too rigid, but LLMs charting their own course feel too chaotic. When you need a middle ground, it’s time to reach for the secret weapon: ontologies. These graph-shaped fragments of actionable knowledge can fill in critical gaps.\r\n\r\nIn this talk, we’ll explore together how ontologies bring structure, semantics, and sanity to GenAI-powered applications. You’ll learn when they’re useful, how to apply them, and what kinds of problems they help solve. Through practical examples, we’ll show how ontologies (1) guide knowledge graph construction, (2) add a semantic layer for more efficient and accurate retrieval (GraphRAG), and (3) encode domain logic you don’t want to leave up to the LLM.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "5 Jun 2025 10:45 AM",
    "Speakers": "Stephen Chin",
    "Companies": "Neo4j",
    "Company Domains": "steve.chin.social",
    "Titles": "VP of Developer Relations"
  },
  {
    "Session ID": "933589",
    "Title": "Pipecat Cloud: Enterprise Voice Agents Built On Open Source",
    "Description": "Voice AI agents today can conduct natural, human-like conversations and perform a wide variety of tasks: customer support, lead qualification, healthcare patient intake, market research, and more.\r\n\r\nToday's best voice agents combine: realtime responsiveness, open-ended conversational intelligence, reliable instruction following, and flexible integration with existing back-end systems.\r\n\r\nLearn how to build state of the art voice agents using Pipecat's open source, vendor neutral tooling. You can deploy Pipecat agents to your own infrastructure or to Pipecat Cloud.\r\n\r\nPipecat is used and supported by teams at NVIDIA, AWS, Google DeepMind, OpenAI, and hundreds of other companies.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Product launch",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "5 Jun 2025 11:00 AM",
    "Speakers": "Mark Backman, Kwindla Kramer",
    "Companies": "Daily, Daily",
    "Company Domains": "daily.co, daily.co",
    "Titles": "VP of Product, unknown"
  },
  {
    "Session ID": "933622",
    "Title": "The Build-Run Divide: How Chime Bridges Product Vision and AI Operational Reality",
    "Description": "Product leaders see AI possibilities. Operations teams see implementation nightmares. The chasm between these perspectives kills promising AI features before they reach users.\r\n\r\nIn this talk, Chris Hernandez (Manager of AI Speech Analytics at Chime) and Jeremy Silva (Product Lead at Freeplay) share an integrated framework we've developed across product strategy and operations at a leading neo-bank. You'll see how we transformed siloed processes into a unified approach that connects prototyping, evaluations, human review workflows, and model benchmarking from day one.\r\n\r\nWe'll reveal the collaborative tools built to make trade-off decisions visible, the evaluation metrics that satisfy both business and technical stakeholders, and the governance model that enabled us to ship AI features 3x faster. Learn how to create processes where product and operations strengthen each other rather than compete, and build AI capabilities that scale beyond individual features into organization-wide advantage.\r\n",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 11:00 AM",
    "Speakers": "Chris Hernandez",
    "Companies": "Chime",
    "Company Domains": "chime.com",
    "Titles": "Manager of AI Speech Analytics"
  },
  {
    "Session ID": "933689",
    "Title": "The State of AI-Powered Search and Retrieval",
    "Description": "In this talk, we examine the state-of-the-art in AI-powered search and retrieval. We detail techniques for enhancing performance beyond base embedding models, including hybrid search, reranking strategies, query decomposition and document enrichment, the use of domain-specific and fine-tuned embeddings, custom data processing pipelines (ETL), and contextualized chunking methods.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "5 Jun 2025 11:00 AM",
    "Speakers": "Frank Liu",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "Staff Product Manager"
  },
  {
    "Session ID": "910158",
    "Title": "The State of Generative Media Today",
    "Description": "Generative AI is reshaping the creative landscape, enabling the production of images, audio, and video with unprecedented speed and sophistication. This session offers an in-depth exploration of the current state of generative media, highlighting cutting-edge models, platforms, and tools that are transforming the industry. ",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "Generative Media (14)",
    "Room": "Foothill F: Generative Media",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Gorkem Yurtseven",
    "Companies": "fal",
    "Company Domains": "fal.ai",
    "Titles": "CTO"
  },
  {
    "Session ID": "912033",
    "Title": "Monetizing AI: From Zero to Profit",
    "Description": "As AI continues to transform industries, companies are faced with the critical challenge of effectively monetizing AI-driven products in a way that captures value, ensures customer adoption, and scales revenue sustainably. Unlike traditional SaaS models, AI-powered products have unique complexities - such as fluctuating usage patterns, variable compute costs, and evolving customer demands, making conventional pricing strategies unhelpful to the growth of an AI product-led startup.\r\n\r\nIn this session, Alvaro Morales, CEO and co-founder of Orb, will explore why the often overlooked monetization aspect of AI is critical for businesses. He’ll share real-world examples and data to demonstrate how adaptive pricing models can drive cost savings, enhance customer experience, and reduce operational bottlenecks.\r\n\r\nAlvaro will lead a live demo, showcasing how engineers can simulate AI pricing strategies and subsequently integrate them with a simple plug-and-play solution. He’ll also share how real-world revenue simulations enable companies to test and refine pricing before implementing — reducing risk, boosting adoption, and unlocking new revenue streams. As a quick example, cloud software development platform Replit was looking to adopt a usage-based pricing model for a new product, but their existing billing system couldn't support the new model, and building a new billing system would delay the launch timeline. In order to get things done, they turned to Orb, which enabled them to make pricing changes up to the last minute. After the launch, Orb became the single source of truth for both Replit and its customers - providing usage alerts to notify Replit when users hit cost thresholds and provide insights into user spend and payment methods.\r\n\r\nKey takeaways: \r\nThe challenge of AI monetization – Why traditional subscription-based SaaS pricing models don’t work for AI-powered products.\r\nPrecision pricing – Exploring how usage-based, tiered, and hybrid pricing models can maximize revenue potential. \r\nRevenue simulation for AI pricing – Leveraging real-time data to test, adjust and optimize pricing strategies.\r\nAvoiding common pricing pitfalls – Identifying mistakes that can lead to revenue leakage and customer churn.\r\n\r\nThis session is designed for AI executives, product leaders, and engineering teams looking for actionable strategies to build adaptive, scalable pricing models that drive long-term growth and profitability.\r\n\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Alvaro Morales",
    "Companies": "Orb",
    "Company Domains": "aircoverpr.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "914027",
    "Title": "UX Design Principles for (Semi) Autonomous Multi-Agent Systems",
    "Description": "Autonomous or semi-autonomous multi-agent systems (MAS) involve exponentially complex configurations (system config, agent configs, task management and delegation, etc.). These present unique interface design challenges for both developer tooling and end-user experiences.\r\nIn this session, I'll explore UX design principles for multi-agent systems, addressing critical questions: What is the true configuration space for autonomous MAS? How can users arrive at the correct mental model of an MAS's capabilities, if at all? How can we improve trust and safety through techniques like cost-aware action delegation? What makes agent actions observable? How do we enable seamless interruptibility? Attendees will gain actionable insights to create more transparent, trustworthy, and user-centered multi-agent applications, illustrated through real-world implementations in AutoGen Studio - a low code developer tool built on AutoGen (44k stars on GitHub, MIT license) and similar tools.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Design Engineering (10)",
    "Room": "Foothill G 1&2: Design Engineering",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Victor Dibia",
    "Companies": "Microsoft Research",
    "Company Domains": "gmail.com",
    "Titles": "Principal Research Software Engineer"
  },
  {
    "Session ID": "914401",
    "Title": "From Hype to Habit: How We’re Building an AI-First SaaS Company—While Still Shipping the Roadmap",
    "Description": "What does it really take to move a modern SaaS company from AI experimentation to becoming truly AI-first?\r\n\r\nAt Sprout Social, we’re in the midst of that transformation—rearchitecting strategy, systems, teams, and incentives to put AI at the heart of how we think, build, and deliver value. This is a story in motion: a behind-the-scenes look at how we’re evolving from isolated AI feature experiments to an AI-native operating model.\r\n\r\nI’ll share what we’re learning as we navigate the innovation dilemma—integrating disruptive AI capabilities without breaking what already works or our roadmap. That includes rethinking how we define success, how we hire, reward, grow talent, and how we handle legal and ethical complexity without slowing down. We’ll explore the real-world tensions between rapid innovation, value delivery, making progress on Responsible AI, all while elevating internal AI fluency, and engaging with the broader AI ecosystem to stay at the edge. \r\n\r\nThis isn’t a playbook from the finish line—it’s a candid reflection from deep inside the journey.\r\n\r\nMy goal is to help other leaders chart their own AI path with greater clarity, confidence, and care.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Rossella Blatt Vital, Deepsha Menghani",
    "Companies": "Sprout Social, Sprout Social",
    "Company Domains": "gmail.com, sproutsocial.com",
    "Titles": "VP of AI, Data, and Data Science, Director of Engineering – AI"
  },
  {
    "Session ID": "914856",
    "Title": "Training Agentic Reasoners",
    "Description": "This talk will be a technical deep dive into RL for agentic reasoning via multi-turn tool calling, similar to OpenAI's o3 and Deep Research. In particular, we'll cover:\r\n- When, why, and how\r\n- GRPO vs PPO vs etc\r\n- Designing environments and rewards\r\n- Survey of recent research highlights\r\n- Results on example tasks\r\n- Overview of open-source ecosystem (libraries, compute requirements, tradeoffs, etc.)",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Reasoning + RL (15)",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Will Brown",
    "Companies": "Prime Intellect",
    "Company Domains": "columbia.edu",
    "Titles": "Research Engineering Lead"
  },
  {
    "Session ID": "925259",
    "Title": "Building AI Agents that actually automate Knowledge Work",
    "Description": "Agents are all the rage in 2025, and every single b2b SaaS startup/incumbent promises AI agents that can \"automate work\" in some way. \r\n\r\nBut how do you actually build this? The answer is two fold: \r\n1. really really good tools \r\n2. carefully tailored agent reasoning over these tools that range from assistant-to-automation based UXs.  \r\n\r\nThe main goal of this talk is to a practical overview of agent architectures that can automate real-world work, with a focus on document-centric tasks. Learn the core building blocks of best-in-class \"tools\" around processing, manipulating, and indexing/retrieving PDFs to Excel spreadsheets. Also learn the range of agent architectures suited for different tasks, from chat assistant-based UXs with high human-in-the-loop, to automation UXs that rely on encoding a business process into an end-to-end task solver. These architectures have to be generalizable but also highly accurate as agents get increasingly better at reasoning and code-writing. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Jerry Liu",
    "Companies": "LlamaIndex",
    "Company Domains": "runllama.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "929855",
    "Title": "Devin 2.0 and the Future of SWE",
    "Description": "A talk on the future of software engineering with Scott Wu of Cognition AI, the makers of Devin.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Scott Wu",
    "Companies": "Cognition AI",
    "Company Domains": "cognition.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "936156",
    "Title": "On Engineering AI Systems that Endure The Bitter Lesson",
    "Description": "Will discuss the principles for building AI software that underpin DSPy, highlighting the differences between conventional prompting (or finetuning/RL) versus the design and programming of truly modular AI systems.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Omar Khattab",
    "Companies": "Databricks",
    "Company Domains": "stanford.edu",
    "Titles": "Research Scientist"
  },
  {
    "Session ID": "938258",
    "Title": "Robotics: why now?",
    "Description": "Sharing recent progress from Physical Intelligence and why it is an exciting time to push the frontier in general purpose robotics",
    "Session Format": "Keynote",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Foothill E: Autonomy + Robotics",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Quan Vuong",
    "Companies": "Physical Intelligence",
    "Company Domains": "physicalintelligence.company",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "938753",
    "Title": "Safety and security for code-executing agents",
    "Description": "Code is the lingua franca for both software engineers and highly capable AI models. As we give agents the ability to build, test, and run code that they generate, the command line becomes their canvas—and their attack surface.\r\n\r\nThis keynote explores what it takes to bring code-executing agents from research to real-world deployment while maintaining control and security. We’ll cover how terminals offer AI an ideal interface, why they’re deceptively risky, and what it means to embed security, guardrails, and trust at every layer.\r\n\r\nIt’s not just about what agents can do—it’s about what they should do, and how we make sure they do it safely.",
    "Session Format": "Keynote",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 11:15 AM",
    "Speakers": "Fouad Matin",
    "Companies": "OpenAI",
    "Company Domains": "openai.com",
    "Titles": "Engineer"
  },
  {
    "Session ID": "903966",
    "Title": "Scaling Enterprise-Grade RAG Systems: Lessons from the Legal Frontier",
    "Description": "In domains like law, compliance, and tax, building enterprise-grade RAG means very large scale, spikey workloads, a focus on accuracy, and non-negotiable privacy.\r\nIn this talk, we'll share war stories and battle scars of how Harvey has built the world's most advanced AI agents for the legal profession on top of a highly optimized retrieval architecture. We'll cover how to get better retrieval via both sparse and dense retrieval methods, why domain-specific reranking is essential, and how to handle ambiguity in real-world queries.\r\nWe'll also touch on how LanceDB's search engine enables this architecture by delivering low-latency, high-throughput retrieval across millions of documents of varying sizes without compromising privacy. This solid foundation enables Harvey to build a product that brings highly accurate answers to hundreds of law firms and professional services firms across 45 countries.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Retrieval + Search (09)",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 11:35 AM",
    "Speakers": "Chang She, Aman Kishore, Calvin Qi",
    "Companies": "LanceDB, Harvey AI, Harvey AI",
    "Company Domains": "lancedb.com, harvey.ai, harvey.ai",
    "Titles": "Founder, Founder, RAG Specialist"
  },
  {
    "Session ID": "904751",
    "Title": "Ship Production Software in Minutes, Not Months",
    "Description": "Planning, coding, testing, monitoring—the endless cycle that spans 10+ tools that fragment our focus and slows delivery to a crawl. Vibe coding doesn't work when you've got 10TB of code. If you just sighed, you're one of many professional software engineers trapped in the traditional software development lifecycle (SDLC) that was designed before AI could parallelize your entire workflow.\r\n\r\nBut what if you could orchestrate multiple AI agents on tasks beyond just generating code, while you focus on the creative decisions that matter?\r\n\r\nIn this talk, I'll demonstrate how real enterprise organizations are changing their entire SDLC—going from understanding, planning, coding, and testing all the way to incident response—using AI agents. You'll witness the next evolution of software engineering—where AI doesn't just generate code, but orchestrates the entire development lifecycle.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Product launch",
    "Assigned Track": "SWE Agents (11)",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 11:35 AM",
    "Speakers": "Eno Reyes",
    "Companies": "Factory",
    "Company Domains": "factory.ai",
    "Titles": "CTO"
  },
  {
    "Session ID": "909905",
    "Title": "The Unofficial Guide to Apple’s Private Cloud Compute",
    "Description": "In October 2024, Apple released a new private AI technology onto millions of devices called “Private Cloud Compute”. It brings the same level of privacy and security a local device offers but on an “untrusted\" remote server. This talk discusses how Private Cloud Compute represents a paradigm shift in confidential computing and explores the core advancements that made it possible to become mainstream. We’ll explore its novel architecture that allows developers to run sensitive, multi-tenant workloads with cryptographically-provably privacy guarantees at scale and at reasonable cost. Attendees will leave with an understanding of how to leverage this technology for data and AI applications where privacy and security is paramount.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Security (13)",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 11:35 AM",
    "Speakers": "Jonathan Mortensen",
    "Companies": "Confident Security",
    "Company Domains": "confidentsecurity.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "914891",
    "Title": "Machines of Buying & Selling Grace",
    "Description": "How to go beyond browser automation to truly agentic commerce, where AI can buy, sell and negotiate on behalf of users and merchants.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 11:35 AM",
    "Speakers": "Adam Behrens",
    "Companies": "New Generation",
    "Company Domains": "new-gen.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "916025",
    "Title": "CIOs and Industry Leaders: Do You Trust Your AI’s Inferences?",
    "Description": "Enterprise AI adoption is accelerating, but with it comes a hard question: Do we trust the model’s decisions? In this 18-minute talk, I’ll explore the invisible risks behind automated decision-making in safety-critical and revenue-sensitive environments. Drawing on case studies across manufacturing, telecom, and industrial IoT, I’ll highlight how explainability, traceability, and robust guardrails drive adoption and protect enterprise value.\r\nAttendees will walk away with:\r\n•\tA 3-step framework for operationalizing AI trust\r\n•\tReal-world lessons from building guardrails in on-prem and hybrid systems\r\n•\tTools and techniques for debugging and explaining inferences at scale\r\n•\tA blueprint for building trust between models, engineers, and executive stakeholders",
    "Session Format": "Talk",
    "Level": "Expert",
    "Scope": "Case Study/War Story",
    "Assigned Track": "",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 11:35 AM",
    "Speakers": "Sahil Yadav, Hariharan Ganesan",
    "Companies": "AOI, NA",
    "Company Domains": "outlook.com, umich.edu",
    "Titles": "Head of Software Products, Sr. Solutions Architect"
  },
  {
    "Session ID": "910197",
    "Title": "Magic Editor Under the Hood: Weaving Generative AI into a Billion-User App",
    "Description": "Go behind the scenes of Google Photos' Magic Editor. Explore the engineering feats required to integrate complex CV and cutting-edge generative AI models into a seamless mobile experience. We'll discuss optimizing massive models for latency/size, the crucial interplay with graphics rendering (OpenGL/Halide), and the practicalities of turning research concepts into polished features people actually use.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Generative Media (14)",
    "Room": "Foothill F: Generative Media",
    "Scheduled At": "5 Jun 2025 11:40 AM",
    "Speakers": "Kelvin Ma",
    "Companies": "Google Photos",
    "Company Domains": "gmail.com",
    "Titles": "Technical Lead"
  },
  {
    "Session ID": "914786",
    "Title": "Inside ARC Prize, Scaling Reasoning, and Dynamic Evals",
    "Description": "ARC Prize Foundation is building the North Star for AGI—rigorous, open benchmarks that track reasoning progress in modern AI. We'll cover how we've evaluated frontier models since GPT-3.5 and share a preview of ARC-AGI-3: a dynamic, game-like benchmark launching next year to test general intelligence.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Reasoning + RL (15)",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 11:40 AM",
    "Speakers": "Greg Kamradt",
    "Companies": "ARC Prize Foundation",
    "Company Domains": "arcprize.org",
    "Titles": "President"
  },
  {
    "Session ID": "914845",
    "Title": "Good design hasn’t changed with AI",
    "Description": "Bad designs are still bad. AI doesn’t make it good. The novelty of AI makes the bad things tolerable, for a short time. Building great designs and experiences with AI have the same first principles pre-AI. When people use software, they want it to feel responsive, safe, accessible and delightful. We’ll go over the big and small details that goes into software that people want to use, not forced to use.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Design Engineering (10)",
    "Room": "Foothill G 1&2: Design Engineering",
    "Scheduled At": "5 Jun 2025 11:40 AM",
    "Speakers": "John Pham",
    "Companies": "The San Francisco Compute Company",
    "Company Domains": "gmail.com",
    "Titles": "Engineer and Designer"
  },
  {
    "Session ID": "916140",
    "Title": "Real-time Experiments with an AI Co-Scientist",
    "Description": "The sheer volume of data and complexity of modern scientific challenges necessitate tools that go beyond mere analysis. The vision of an \"AI Co-scientist\" – a true collaborative partner in the lab – requires sophisticated engineering to bridge the gap between powerful AI reasoning and the dynamic reality of physical experiments. This talk dives into the engineering required to build robust AI Co-scientists for hands-on research. We will explore scalable architectures, such as multi-agent systems leveraging foundation models like Gemini for complex reasoning, hypothesis refinement (inspired by the \"generate, debate, evolve\" paradigm described in recent AI Co-scientist research), and intelligent tool use. The core focus will be on the engineering challenges and solutions for integrating diverse, real-time empirical data streams – visual data from cameras, quantitative readings from sensors, positional feedback from actuators, and instrument outputs – directly into the AI's reasoning loop. I will illustrate this with concrete, technically detailed examples in chemistry (adaptive reaction monitoring), robotics (vision-guided assembly with SO Arm 100 and LeRobot library), and synthetic biology (real-time bacterial growth monitoring & interpretation). We'll discuss engineering strategies for handling data heterogeneity, latency, noise, and enabling the AI to interpret, correlate, and act upon live experimental feedback. Finally, we will touch upon how thoughtful engineering of these AI Co-scientists can contribute to democratizing access to advanced scientific capabilities.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Autonomy + Robotics (16)",
    "Room": "Foothill E: Autonomy + Robotics",
    "Scheduled At": "5 Jun 2025 11:40 AM",
    "Speakers": "Stefania Druga",
    "Companies": "Google",
    "Company Domains": "hackidemia.com",
    "Titles": "Research Scientist"
  },
  {
    "Session ID": "936133",
    "Title": "Turning Fails into Features: Zapier’s Hard-Won Eval Lessons",
    "Description": "Every agent failure can be a roadmap to your next breakthrough. This talk reveals how Zapier's evaluation system transforms frustrating user experiences into targeted improvements, creating a data flywheel that continuously strengthens our agents. You'll learn practical approaches for building the data flywheel, detecting implicit feedback signals, building solid evals, prioritizing metrics that actually matter, and why your most reliable evals might secretly be sabotaging your performance.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 11:40 AM",
    "Speakers": "Rafal Wilinski, Vitor Balocco",
    "Companies": "Zapier, Zapier",
    "Company Domains": "gmail.com, gmail.com",
    "Titles": "AI Tech Lead, Staff Software Engineer"
  },
  {
    "Session ID": "913839",
    "Title": "Evaluating AI Search: A Practical Framework for Augmented AI Systems",
    "Description": "AI search is becoming the front door to information, whether through Retrieval-Augmented Generation (RAG), Search-Augmented Generation (SAG), or custom agents that synthesize answers on top of indexed content. As users rely more heavily on these systems, evaluating their quality becomes mission-critical. But traditional metrics like precision and recall don’t capture the full picture.\r\n\r\nIn this talk, we introduce a practical evaluation framework for AI-powered search, across three dimensions:\r\n- Are the retrieved sources relevant to the query?\r\n- And is the final answer complete?\r\n- Are the sources faithfully used in the generated answer?\r\n\r\nWe’ll share lessons from working with search companies and present early findings from a new benchmark evaluating popular augmented AI systems across these dimensions. Rather than ranking winners and losers, we explore where different systems excel or break down, and how these tradeoffs inform product decisions.\r\n\r\nThis talk is for AI engineers and product teams who want to build trusted, high-quality AI search experiences, and need a way to measure if it’s actually working.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Retrieval + Search (09)",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 11:55 AM",
    "Speakers": "Julia Neagu, Deanna Emery, Maitar Asher",
    "Companies": "Quotient AI, Quotient AI, Tavily",
    "Company Domains": "quotientai.co, quotientai.co, tavily.com",
    "Titles": "CEO, Founding AI Researcher, Head of Engineering"
  },
  {
    "Session ID": "914017",
    "Title": "Beyond the Prototype: Using AI to Write High-Quality Code",
    "Description": "In this case study-based keynote, Josh Albrecht, CTO of Imbue, examines the critical engineering challenges in building AI coding systems that create more than just prototypes. Drawing from Imbue's research developing Sculptor, an experimental coding agent environment, Josh shares key insights into the fundamental technical obstacles encountered when evolving AI-assisted coding from toy applications to more robust software systems. \r\n\r\nThe session will explore approaches to core challenges like safely executing code, managing context across large codebases, automating test generation, and creating systems that can identify potential pitfalls in AI-generated code. Attendees will gain practical insights into the technical underpinnings of next-generation coding agents that aim to handle complex software engineering challenges architecting larger systems, increasing meaningful test coverage and designing systems that are easy to debug—moving us closer to AI systems that can help create maintainable software.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "SWE Agents (11)",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 11:55 AM",
    "Speakers": "Josh Albrecht",
    "Companies": "Imbue",
    "Company Domains": "imbue.com",
    "Titles": "CTO"
  },
  {
    "Session ID": "914912",
    "Title": "Does AI Actually Boost Developer Productivity? (Stanford / 100k Devs Study)",
    "Description": "Forget vendor hype: Is AI actually boosting developer productivity, or just shifting bottlenecks? Stop guessing.\r\n\r\nOur study at Stanford cuts through the noise, analyzing real-world productivity data from nearly 100,000 developers across hundreds of companies. We reveal the hard numbers: while the average productivity boost is significant (~20%), the reality is complex – some teams even see productivity decrease with AI adoption.\r\n\r\nThe crucial insights lie in why this variance occurs. Discover which company types, industries, and tech stacks achieve dramatic gains versus minimal impact (or worse). Leave with the objective, data-driven evidence needed to build a winning AI strategy tailored to your context, not just follow the trend.\r\n",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 11:55 AM",
    "Speakers": "Yegor Denisov-Blanch",
    "Companies": "Stanford University",
    "Company Domains": "stanford.edu",
    "Titles": "Researcher"
  },
  {
    "Session ID": "915978",
    "Title": "Fuzzing in the GenAI Era",
    "Description": "\"Evaluation\" is one of those concepts that every AI practitioner vaguely knows is important, but few practitioners truly understand. Is \"eval\" the dataset for measuring the quality of your AI system? Is \"eval\" the measure, the metric of quality? Is \"eval\" the process of human annotation and scoring? Or is \"eval\" a third-party dataset run once to benchmark a model?\r\n\r\nTo mitigate this cacophony, this talk will provide an opinionated and principled perspective for what we actually mean when we say “evaluation”, beyond the traditional for-loop-over-a-static dataset. \r\n\r\nIn particular, this perspective draws heavy inspiration from *fuzzing*, i.e. bombarding AI with simulated, unexpected user inputs to uncover corner cases at scale. This factors into sub-problems regarding:\r\n\r\n- Quality Metric. What is the actual criteria we, as humans, are using to determine if an AI system is producing good or bad responses? How do we elicit these criteria before the human SME can articulate them? How do we, as efficiently as possible, operationalize this criteria with an automated *Judge*?\r\n\r\n- Stimuli Generation. Given a metric, how do we know, with confidence, that an AI system is performing well with respect to the metric? What data is representative and sufficient for discovering all potential bugs of an AI system? And how do we generate this complex, diverse, faithful data at scale? \r\n\r\nWe will discuss in detail the philosophy, technology, and case studies behind both problems of Quality Metric and Stimuli Generation, and how they interact in concert.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Security (13)",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 11:55 AM",
    "Speakers": "Leonard Tang",
    "Companies": "Haize Labs",
    "Company Domains": "haizelabs.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "916085",
    "Title": "How Intuit uses LLMs to explain taxes to millions of taxpayers",
    "Description": "I will talk about how Intuit uses LLMs to explain tax situations to Turbotax users.\r\nUsers want explanations of their tax situations - this drives confidence in the product. Over the course of last two tax years, Intuit has built out explanations using Anthropic and openAI’s models to develop genAI powered explanations. This includes design a complex system with prompt engineered solutions and both LLM & human powered evaluations to ensure high quality bar that our users expect when filing taxes with us.\r\nDuring the course of my talk, I will talk across GenAI development lifecycle at scale - including development , evaluations and scaling. And security evaluations. We also developed a fine-tuned version of Claude Haiku & shall be covering that in the presentation.\r\nWe also expanded into tax question and answering powered by RAG, including graphRAG and I would be covering those developments too.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 11:55 AM",
    "Speakers": "Jaspreet Singh",
    "Companies": "Intuit",
    "Company Domains": "gmail.com",
    "Titles": "Senior Staff Software Engineer"
  },
  {
    "Session ID": "914361",
    "Title": "AI and Game Theory: A Case Study on NYT's Connections",
    "Description": "This session will examine the interplay between human intuition and artificial intelligence in puzzle-solving, using the popular New York Times Connections game as a practical case study. \r\n\r\nWe'll investigate how gameplay can be systematically evaluated through AI algorithms, exploring machine learning strategies such as clustering, semantic mapping, and natural language processing. \r\n\r\nAttendees will gain insights into building AI-driven puzzle solvers, learn methods for quantitatively assessing gameplay complexity, and discuss the potential impacts of AI on puzzle game design and player engagement.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Design Engineering (10)",
    "Room": "Foothill G 1&2: Design Engineering",
    "Scheduled At": "5 Jun 2025 12:05 PM",
    "Speakers": "Shafik Quoraishee",
    "Companies": "New York Times",
    "Company Domains": "nytimes.com",
    "Titles": "Senior Android Games Engineer"
  },
  {
    "Session ID": "915745",
    "Title": "Post-Training Open Models with RL for Autonomous Coding",
    "Description": "The models and techniques to build fully autonomous coding agents - not just coding copilots - are already here. In this talk, former Google DeepMind staff research scientist, now CEO of Reflection Misha Laskin will present new research on post-training open weight LLMs for autonomous SWE tasks. He’ll focus on how scaling LLMs with Reinforcement Learning improves the autonomous coding capabilities of LLMs, and provide insight on the technical challenges required to train such systems at scale. ",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Reasoning + RL (15)",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 12:05 PM",
    "Speakers": "Misha  Laskin",
    "Companies": "Reflection",
    "Company Domains": "reflection.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "916103",
    "Title": "What Is a Humanoid Foundation Model? An Introduction to GR00T N1",
    "Description": "Foundation models don’t just write or draw anymore—they’re starting to move.\r\n\r\nGR00T N1 is NVIDIA’s open Vision-Language-Action (VLA) foundation model for humanoid robots. Built with a dual-system architecture, it combines a System 2 module for high-level reasoning with a System 1 module for real-time, fluid motor control. It’s trained end-to-end on a an impressive mix of data—from human videos to robot trajectories to synthetic simulations—and deployed on a full-sized humanoid robot performing bimanual manipulation tasks in the real world.\r\nThis talk is a high-level, beginner-friendly overview of GR00T N1:\r\n- What makes a robot foundation model different from an LLM or vision model\r\n- How GR00T’s architecture is inspired by cognitive systems\r\n- Why grounding language, vision, and action together unlocks new generalist capabilities\r\n\r\nIf you’ve ever wondered how large-scale AI is crossing over into the physical world, this session will get you up to speed—no robotics PhD required.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "Autonomy + Robotics (16)",
    "Room": "Foothill E: Autonomy + Robotics",
    "Scheduled At": "5 Jun 2025 12:05 PM",
    "Speakers": "Annika Brundyn, Aastha Jhunjhunwala",
    "Companies": "NVIDIA, NVIDIA",
    "Company Domains": "nvidia.com, nvidia.com",
    "Titles": "Senior Solutions Architect, Solutions Architect"
  },
  {
    "Session ID": "939231",
    "Title": "Evals Are Not Unit Tests",
    "Description": "How to think about evaluating a non-deterministic system — and how to actually succeed at it.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 12:05 PM",
    "Speakers": "Ido Pesok",
    "Companies": "Vercel",
    "Company Domains": "vercel.com",
    "Titles": "Engineer and Researcher"
  },
  {
    "Session ID": "914814",
    "Title": "AX is the only Experience that Matters",
    "Description": "If you’re building devtools for humans, you’re building for the past. \r\n\r\nAlready a quarter of Y Combinator’s latest batch used AI to write 95% or more of their code. AI agents are scaling at an exponential rate and soon, they’ll outnumber human developers by orders of magnitude.\r\n\r\n\r\nThe real bottleneck isn’t intelligence. It’s tooling. Terminals, local machines, and dashboards weren’t built for agents. They make do… until they can’t.\r\n\r\nIn this talk, I’ll share how we killed the CLI at Daytona, rebuilt our infrastructure from first principles, and what it takes to build devtools that agents can actually use. Because in an agent-native future, if agents can’t use your tool, no one will.\r\n",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 12:15 PM",
    "Speakers": "Ivan Burazin",
    "Companies": "Daytona",
    "Company Domains": "gmail.com",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "933458",
    "Title": "Don’t get one-shotted: Leveraging AI to test, review, merge, and deploy code",
    "Description": "As AI tools like GitHub Copilot and ChatGPT help engineers generate code at an unprecedented rate, the “outer loop”—reviewing, testing, merging, and deploying—becomes more vital than ever. Studies have shown that up to half of AI-generated solutions contain bugs or vulnerabilities, underscoring the continued importance of thorough, human-in-the-loop reviews. In this talk we'll take a look at how next-gen developer tools can harness AI not just for generating code, but also reviewing it. By thoughtfully integrating AI into that fully understands your entire codebase, teams can accelerate velocity without sacrificing quality.\r\n\r\nAttendees will learn real-world strategies and best practices for establishing an “outer loop” that safely and efficiently deploys high volumes of AI-assisted code,  without compromising reliability. We’ll also discuss pitfalls to avoid when integrating AI into existing pipelines.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 12:15 PM",
    "Speakers": "Tomas Reimers",
    "Companies": "Graphite",
    "Company Domains": "graphite.dev",
    "Titles": "CPO"
  },
  {
    "Session ID": "933610",
    "Title": "Ship it! Building Production-Ready Agents",
    "Description": "Explore the practical challenges and solutions for deploying AI agents in real-world production environments. Through detailed technical analysis and practical examples, we'll examine strategies for building and orchestrating agent systems at scale. We'll cover critical infrastructure decisions, scalability frameworks, and best practices for creating robust, production-ready agent architectures.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 12:15 PM",
    "Speakers": "Mike Chambers",
    "Companies": "Amazon Web Services",
    "Company Domains": "aws.amazon.com",
    "Titles": "Senior Developer Advocate"
  },
  {
    "Session ID": "933678",
    "Title": "RAG in 2025: State of the Art and the Road Forward",
    "Description": " The talk will have three parts\r\n1.Roadmap debate: RAG vs. finetuning vs. long-context\r\n2.RAG today: benefits, challenges, and current solutions\r\n3.RAG tomorrow: AI models do more work",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 12:15 PM",
    "Speakers": "Tengyu Ma",
    "Companies": "MongoDB",
    "Company Domains": "mongodb.com",
    "Titles": "Chief AI Scientist"
  },
  {
    "Session ID": "936795",
    "Title": "Building with Open Standards for Agents",
    "Description": "To make AI agents production ready, authentication and authorization are fundamental. AI agents need to understand who the user is and what they are allowed to access or do. Otherwise, they risk allowing unauthorized operations or sharing data users shouldn't have access to.\r\n\r\nThis means it is paramount to solve these four challenges: \r\n•Knowing who users are\r\n•Calling APIs on their behalf\r\n•Retrieving only data users are allowed to see\r\n•Managing human in the loop and authorization interaction with UI less agents\r\n\r\nWe'll demo how Auth for GenAI, Auth0's new product for AI agents, solves these in a developer-friendly and secure way, so developers and teams building AI apps  can focus on building their products. This talk is for Engineers building production AI applications, not just demos. You'll walk away with a clear understanding of where identity fits in the GenAI stack and how to build truly secure and capable agents with it.",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 12:15 PM",
    "Speakers": "Bobby Tiernay, Kameron Sween",
    "Companies": "Okta (Auth0), Auth0",
    "Company Domains": "okta.com, auth0.com",
    "Titles": "Architect, Staff Engineer"
  },
  {
    "Session ID": "933580",
    "Title": "Optimizing inference for voice models in production",
    "Description": "How do you get time to first byte (TTFB) below 150 milliseconds for voice models -- and scale it in production? As it turns out, open-source TTS models like Orpheus have an LLM backbone that lets us use familiar tools and optimizations like TensorRT-LLM and FP8 quantization to serve the models with low latency. But client code, network infrastructure, and other outside-the-GPU factors can introduce latency in the production stack. In this talk, we'll cover the basic mechanics of TTS inference, common pitfalls to avoid in integrating them into production systems, and how to extend this high-performance system to serve customized models with voice cloning and fine-tuning.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:30 PM",
    "Speakers": "Philip Kiely",
    "Companies": "Baseten",
    "Company Domains": "baseten.co",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "933599",
    "Title": "Serving Voice  AI at Scale",
    "Description": "Real-Time  Voice AI applications demand the lowest possible latencies to enhance user  experiences with more advanced reasoning and agentic capabilities. AWS is  hosting Arjun Desai, CTO and co-founder of Cartesia, in a fireside chat for a  technical deep dive into learnings and best practices for building a  state-of-the-art inference stack that serves global enterprise customers.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:30 PM",
    "Speakers": "Arjun Desai",
    "Companies": "Cartesia",
    "Company Domains": "cartesia.ai",
    "Titles": "CTO"
  },
  {
    "Session ID": "933712",
    "Title": "Prompt Engineering is Dead",
    "Description": "Manual prompt crafting doesn't scale. In this session, we'll explore how to replace it with a test-driven, automated approach. You'll see how to define output evaluators, write minimal prompts, and let agents iterate toward optimal performance—all without manual tweaking. If you're still hand-tuning prompts, you're doing it wrong.",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:30 PM",
    "Speakers": "Nir Gazit",
    "Companies": "Traceloop",
    "Company Domains": "traceloop.io",
    "Titles": "CEO"
  },
  {
    "Session ID": "933569",
    "Title": "Building CISO-approved agent fleet architecture",
    "Description": "Security is the biggest blocker for agent orchestration adoption in regulated industries for SWE agents. Gitpod's agent orchestration went from an originally self-hosted kubernetes architecture to the current 'bring your own cloud' model that enables deployment our SWE agent orchestration platform in secure environments. The architecture allows customers to securely connect their foundational models and agent memory solutions and comes with features like auto-suspend and resume for agent fleets. In this talk we deep dive into the architecture to share our years of learnings in how to secure agent workloads at scale in secure and regulated environments. ",
    "Session Format": "",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:45 PM",
    "Speakers": "Lou Bichard",
    "Companies": "Gitpod",
    "Company Domains": "gitpod.io",
    "Titles": "Product Manager"
  },
  {
    "Session ID": "933656",
    "Title": "Agents, Access, and the Future of Machine Identity",
    "Description": "AI agents are calling APIs, submitting forms, and sending emails—but how do you control what they’re allowed to do? As agents act on behalf of users or organizations, traditional patterns like OAuth, session tokens, and role-based access often fall short.\r\nIn this talk, we’ll explore how machine identity is evolving to meet this new landscape. You’ll learn:\r\n\r\n- How to think about authentication for agents (not just humans)\r\n- What it means to authorize an action when the actor is an LLM or headless service\r\n- Real-world strategies from WorkOS and Cloudflare for assigning, managing, and revoking agent identity and access\r\n\r\nBy the end, you’ll walk away with practical tools and mental models to build agent-powered systems that are secure, auditable, and scalable.",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:45 PM",
    "Speakers": "Nick Nisi",
    "Companies": "WorkOS ",
    "Company Domains": "nisi.org",
    "Titles": "Software Engineer"
  },
  {
    "Session ID": "933671",
    "Title": "Agentic GraphRAG: Simplifying Retrieval Across Structured & Unstructured Data",
    "Description": "Agentic workflows often become complex, brittle, and hard to maintain when they need to retrieve and reason across both structured data (typically requiring precise query execution) and unstructured data (commonly handled via vector search in RAG). In this talk, we’ll explore how mapping key information into a knowledge graph can simplify these workflows and improve retrieval quality. You’ll learn core concepts behind GraphRAG, how to integrate it into agent tools, and get access to end-to-end code examples so you can start building right away.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Nobhill A&B: Expo Sessions",
    "Scheduled At": "5 Jun 2025 12:45 PM",
    "Speakers": "Zach Blumenfeld",
    "Companies": "Neo4j",
    "Company Domains": "neo4j.com",
    "Titles": "AI/ML graph specialist"
  },
  {
    "Session ID": "913351",
    "Title": "How to defend your sites from AI bots",
    "Description": "Constantly seeing CAPTCHAs? It used to be easy to detect the humans from the droids, but what else can we do when synthetic clients make up nearly half of all web requests. Rotating IPs, spoofed browsers, and agents acting on behalf of real users - are we doomed to forever be solving puzzles?\r\n\r\nIn this talk, we’ll explore user agents, HTTP fingerprints, and IP reputation signals that make humans and agents stand out from scrapers, build a realistic threat model, and dig into the behaviors that reveal the LLM-mimicry. Leave with AX- and UX-safe code, benchmarks, and tools to help you take back control.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Security (13)",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "David Mytton",
    "Companies": "Arcjet",
    "Company Domains": "arcjet.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "914049",
    "Title": "How to Build Planning Agents without losing control",
    "Description": "Planning agents help solve complex tasks by breaking them into steps. They work across enterprise systems where data lives in many places. These agents are powerful but can be hard to control. This session shows how to use blueprints as guardrails for these agents. I will explain techniques to ensure agents follow the right plan. I will cover evaluation methods to verify agents stay aligned with user goals.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Yogendra Miraje",
    "Companies": "FactSet Research Systems Inc",
    "Company Domains": "gmail.com",
    "Titles": "AI Engineer"
  },
  {
    "Session ID": "914081",
    "Title": "General Intelligence is Multimodal",
    "Description": "Talking about Luma AI, our mission, and how our ML infrastructure enables SOTA multimodal model development ",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Generative Media (14)",
    "Room": "Foothill F: Generative Media",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Keegan McCallum",
    "Companies": "Luma AI",
    "Company Domains": "keeganmccallum.com",
    "Titles": "Head of ML infrastructure"
  },
  {
    "Session ID": "914533",
    "Title": "How to Train Your Agent: Building Reliable Agents with RL",
    "Description": "Have you ever launched an awesome agentic demo, only to realize no amount of prompting will make it reliable enough to deploy in production? Agent reliability is a famously difficult problem to solve!\r\n\r\nIn this talk we’ll learn how to use GRPO to help your agent learn from its successes and failures and improve over time. We’ve seen dramatic results with this technique, such as an email assistant agent that whose success rate jumped from 74% to 94% after replacing o4-mini with an open source model optimized using GRPO.\r\n\r\nWe’ll share case studies as well as practical lessons learned around the types of problems this works well for and the unexpected pitfalls to avoid.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Reasoning + RL (15)",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Kyle Corbitt",
    "Companies": "OpenPipe",
    "Company Domains": "openpipe.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "915389",
    "Title": "AI and Human Whiteboarding Partnership",
    "Description": "Covid sent everybody home and created the space of virtual whiteboards. At first the experience reused the physical constraints but soon it became better than a physical whiteboard thanks to using virtual native concepts like copy-paste and using keyboard input.\r\nThe next step in this evolution is to integrate AI into the workflow. We've tried a lot of things with Excalidraw and ended up landing on turning prompt into diagram. Come to the talk to understand how it fits into the workflow and how we implemented it.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Design Engineering (10)",
    "Room": "Foothill G 1&2: Design Engineering",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Christopher Chedeau",
    "Companies": "Facebook",
    "Company Domains": "gmail.com",
    "Titles": "Engineer"
  },
  {
    "Session ID": "915934",
    "Title": "Teaching Cars to Think: Language Models and Autonomous Vehicles",
    "Description": "This session explores Waymo's latest research on the End-to-End Multimodal Model for Autonomous Driving (EMMA) and advanced sensor simulation techniques. Jyh-Jing Hwang will demonstrate how multimodal large language models like Gemini could improve autonomous driving through unified end-to-end architectures that process raw sensor data directly into driving decisions. \r\n\r\nThe presentation will showcase EMMA's state-of-the-art performance in trajectory planning, 3D object detection, and road graph understanding, as well as another Drive&Gen research approach to sensor simulation for evaluating an end-to-end motion planning model. Attendees will gain insights into the benefits of co-training across multiple autonomous driving tasks and the potential of controlled video generation for testing under various environmental conditions.\r\n\r\nMore on EMMA here: https://waymo.com/blog/2024/10/introducing-emma\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Autonomy + Robotics (16)",
    "Room": "Foothill E: Autonomy + Robotics",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Jyh-Jing Hwang",
    "Companies": "Waymo ",
    "Company Domains": "google.com",
    "Titles": "Research Scientist and Technical Lead Manager"
  },
  {
    "Session ID": "916215",
    "Title": "Ingest, Chunk, Retrieve: How We Built an AI Sales Rep that Trains Herself",
    "Description": "AI agents and digital workers are becoming an essential tool for teams of all sizes and across all industries. However, training these agents to become experts in your product, business, and customers remains a significant challenge. But what if onboarding a digital worker was as simple as uploading your pitch deck? At 11x, we built Alice, an AI sales rep that writes outbound emails with the nuance and context of a top-performing human - because she learns like one too.\r\n\r\nIn this talk, we'll share how we built a RAG system that lets users train Alice on their internal materials: PDFs, websites, call recordings, and more. We'll walk through our ingestion flow, OCR and chunking pipeline, and explain how we leveraged different technologies and vendors to support a wide-range of file types. We'll also discuss how we leveraged Pinecone and other vector embedding technologies to drive relevant, high-performing messaging. Finally, I'll share what we’ve learned running this system in production across 300+ customers and over 1m prospect interactions each month.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Retrieval + Search (09)",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Sherwood Callaway, Satwik Singh",
    "Companies": "11x AI, 11x AI",
    "Company Domains": "gmail.com, gmail.com",
    "Titles": "Engineering Manager, Member of Technical Staff"
  },
  {
    "Session ID": "933686",
    "Title": "CIAM for AI: Who Are Your Agents and What Can They Do?",
    "Description": "AI agents are changing the way modern SaaS products operate. Whether automating workflows, integrating with APIs, or acting on behalf of users, AI-driven assistants and autonomous systems are becoming core product features. But securing these agents presents a fundamental challenge: How do you authenticate AI agents? How do you control what they can access? How do you ensure they act within the right permissions? This talk will explore these concepts and more while highlighting current research and best practices.",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Michael Grinich",
    "Companies": "WorkOS",
    "Company Domains": "workos.com",
    "Titles": "Founder and CEO"
  },
  {
    "Session ID": "939130",
    "Title": "[Evals Keynote] tba",
    "Description": "tbc",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "Evals (12)",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Ankur Goyal",
    "Companies": "Braintrust",
    "Company Domains": "braintrust.com",
    "Titles": "unknown"
  },
  {
    "Session ID": "939942",
    "Title": "Introducing Claude Code",
    "Description": "Hear about Claude Code directly from its creator: origin story, getting your team set up, and practical tips for getting more out of Code.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 02:00 PM",
    "Speakers": "Boris Cherny",
    "Companies": "Anthropic",
    "Company Domains": "anthropic.com",
    "Titles": "Member of Technical Staff"
  },
  {
    "Session ID": "914024",
    "Title": "Building a Smarter AI Agent with Neural RAG",
    "Description": "RAG quality for AI agents is critical, and traditional keyword-based search engines consistently underperform in agentic or multi-step tasks, where semantic grounding and contextual nuance matter most.\r\n\r\nIn this talk, Will Bryk, CEO of Exa will live code two AI agent applications–one using traditional keyword search RAG and one using neural network RAG via vector search. He’ll then evaluate both applications based on task performance, relevance, and latency. With a live demo (no theory or pre-baked applications), the audience will get a firsthand look at the practical differences between keyword and semantic systems in production, and learn embedding strategies, indexing trade-offs, hybrid retrieval techniques, prompt tuning, and more. ",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Technical deep dive",
    "Assigned Track": "Retrieval + Search (09)",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Will Bryk",
    "Companies": "Exa",
    "Company Domains": "sixeastern.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "915059",
    "Title": "2025 is the Year of Evals!  Just like 2024, and 2023, and …",
    "Description": "AI is getting deployed without guardrails, without governance, without due diligence.  Surely this is the year we’ll see a Fortune 500 CEO fired because of a preventable AI incident.  Surely this is the year we’ll see enterprises wake up to pre-deployment evaluation and post-deployment monitoring being an urgent need.  This story hasn’t changed for a decade, but surely this is the year it will.\r\n\r\nIn this talk, I’ll cover what enterprise-level AI/ML evaluation has looked like for the last decade - what’s changed, what hasn’t, what sells, what doesn’t, and where I see things going from here on out.  Evaluation matters - we all know this - but using my experience in the trenches over the last decade or so I hope to bridge the gap between what practitioners need and what the C-suite pays for in the space of AI evaluations.\r\n",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Evals (12)",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "John Dickerson",
    "Companies": "Mozilla AI",
    "Company Domains": "mozilla.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "915387",
    "Title": "Software Development Agents: What Works and What Doesn't",
    "Description": "The adoption of AI into software development has been bumpy. While autocomplete tools like Copilot have gone mainstream, autonomous agents like Devin and OpenHands have generated both enthusiasm and skepticism. Some engineers claim they generate a 10x productivity boost; others that they just create noise and tech debt.\r\n\r\nThe difference between the enthusiasts and the skeptics is that the enthusiasts have reasonable expectations for what these agents can do, and have both practical and intuitive knowledge for how to use them effectively.\r\n\r\nIn this session, we'll talk about what tasks are appropriate for today's software agents, what tasks they might start to succeed at in 2025, and what tasks are best left to humans no matter how good they get.\r\n\r\nSession Outline:\r\nLearn how to use software development agents like OpenHands (fka OpenDevin) effectively, without creating noise and tech debt.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "SWE Agents (11)",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Robert Brennan",
    "Companies": "All Hands AI",
    "Company Domains": "all-hands.dev",
    "Titles": "CEO"
  },
  {
    "Session ID": "915751",
    "Title": "How to Secure Agents using OAuth",
    "Description": "We all know sharing passwords is bad (unless you want free TV), so why are we sharing API keys with AI?  We shouldn't, and that’s why we need to talk about OAuth.\r\n\r\nIn this talk, we will give a brief intro to OAuth.  Then we will talk about the state of authorization in MCP.  We will show how an MCP client uses OAuth to authenticate a user and securely access private resources and tools hosted by an MCP server.  Then we’ll look at ways autonomous agents can use OAuth on their own behalf, talking to other agents and MCP servers directly.  We’ll learn how to use OAuth to build agents that humans and machines can trust.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Security (13)",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Jared Hanson",
    "Companies": "Keycard",
    "Company Domains": "keycard.sh",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "915921",
    "Title": "Testing the Un-Testable: Monitoring AI Products in the Wild",
    "Description": "Evals are straightforward—like unit tests, they confirm your model got specific test cases right.\r\n\r\nBut in the real world, your AI encounters millions of unpredictable interactions each day. How do you gauge user trust, identify frustrations, and adapt when there's no single \"correct\" output? Diving through endless logs and manually adding one eval at a time won't cut it.\r\n\r\nIn this session, we'll explore how leading teams are moving beyond static evals; leveraging semantic analytics, LLM teachers, and AI-powered monitoring to deeply understand user experiences at scale—building AI products that don’t just pass tests, but genuinely resonate with users.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI Architects (L1)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Ben Hylak, Sid Bendre",
    "Companies": "Raindrop.ai, Oleve",
    "Company Domains": "dawnai.com, oleve.co",
    "Titles": "Co-founder, Co-founder"
  },
  {
    "Session ID": "925912",
    "Title": "POC to PROD: Hard Lessons from 200+ Enterprise GenAI Deployments",
    "Description": "The transition from experimental GenAI demonstrations to robust, production-grade systems involves significant technical and organizational complexities. Humans provide a ceiling on the true ROI of automations. This session synthesizes key patterns and practical strategies gathered from more than 200 GenAI implementations across multiple industries and business sizes.\r\n\r\nBeyond the general lessons that apply to most products leveraging GenAI, we'll cover detailed observations within three application areas: multimodal understanding and search, enterprise knowledge retrieval, and AI agent architectures. We will share real-world comparative performance data and metrics on embedding models, vector index implementations, and explore various implementation methodologies that balance performance and cost.\r\n\r\nAdditionally, the session addresses organizational insights critical to successful AI deployments, such as the importance of clearly defined evaluation processes and understanding real-world user interaction challenges, highlighted by examples from healthcare environments. Attendees will gain an understanding of decision-making criteria, including the appropriate complexity of prompt engineering versus more elaborate orchestration methods, token/cost management strategies in multilingual settings, and the challenges in driving behavioral change with new UX and application interaction capabilities.\r\n\r\nParticipants will leave equipped with practical, data-supported insights for effectively navigating their own GenAI projects, including benchmarks and criteria for informed technology selection, and techniques to streamline the transition from initial concept to sustainable operational deployment. Please note, we all know this field evolves rapidly and we will mark which lessons we believe are immutable.",
    "Session Format": "Talk",
    "Level": "Advanced",
    "Scope": "Case Study/War Story",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Randall Hunt",
    "Companies": "Caylent",
    "Company Domains": "caylent.com",
    "Titles": "CTO"
  },
  {
    "Session ID": "926721",
    "Title": "What Reinforcement Learning with Verifiable Rewards Changed",
    "Description": "Reinforcement learning with verifiable rewards (RLVR) came onto the field with a storm after the DeepSeek R1 model showed that training reasonable models was accessible to the entire AI industry. Next it became table stakes for high scores in math and code, but quickly it's shifting to opening the doors on new types of models entirely -- those enabling tool use, reasoning, code execution, and everything to come together to new experiences.\r\n\r\nThis talk describes how RLVR emerged in such a sudden way, what we can glean about AI research generally, and how RLVR changed the AI models we will use forever. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Nathan Lambert",
    "Companies": "Allen Institute for AI",
    "Company Domains": "natolambert.com",
    "Titles": "Senior Research Scientist"
  },
  {
    "Session ID": "934617",
    "Title": "tldraw.computer",
    "Description": "(tbc)",
    "Session Format": "Talk",
    "Level": "",
    "Scope": "",
    "Assigned Track": "Design Engineering (10)",
    "Room": "Foothill G 1&2: Design Engineering",
    "Scheduled At": "5 Jun 2025 02:25 PM",
    "Speakers": "Steve  Ruiz",
    "Companies": "tldraw",
    "Company Domains": "tldraw.com",
    "Titles": "CEO"
  },
  {
    "Session ID": "907695",
    "Title": "Layering every technique in RAG, one query at a time",
    "Description": "Start with the simplest Search - in-memory embeddings with relevance ranking. End with the most complex planet-scale Search - 70+ corpus mix of token, embeddings, and knowledge graphs, all jointly retrieved, custom ranked, joint re-ranked, and then LLM-processed, at 160,000 queries per second in under 200msec.\r\n\r\nThis talk will be a fun “one query at a time” survey of all techniques in RAG in incremental complexity, showing the limits of each technique and what the next layered one opens up in terms of capabilities to handle ever-more complex queries in RAG. You’ll learn why queries like [falafel] are notoriously hard to Search over, why chunking your documents can be disastrous, how you can sometimes can get away with a simple bm25, and how some Search problems are so hard to solve that you’re better off punting the problem to the LLM or the UX. Brought to you by the team that worked on 50+ Search products, in the context of Google.com and custom Enterprise Search.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Retrieval + Search (09)",
    "Room": "Golden Gate Ballroom A: Retrieval + Search",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "David Karam",
    "Companies": "Pi Labs",
    "Company Domains": "withpi.ai",
    "Titles": "Co-founder"
  },
  {
    "Session ID": "914012",
    "Title": "Your Coding Agent Just Got Cloned And Your Brain Isn't Ready",
    "Description": "Will the future engineer code alongside a single coding agent, or will they spend their day orchestrating many agents? Traditional development rewards synchronous focus. This session dives into the significant mindshift required to move from sequential coding to orchestrating parallel agents. We are the builders of \"Jules\", Google's massively parallel asynchronous coding agent (to be opened up in May). We'll share real-world insights from building Jules and explore how to rewire your brain for this powerful new \"post-IDE\" development paradigm.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Case Study/War Story",
    "Assigned Track": "SWE Agents (11)",
    "Room": "Yerba Buena Ballroom 7&8: SWE Agents",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Rustin Banks",
    "Companies": "Google Labs",
    "Company Domains": "google.com",
    "Titles": "Product Manager"
  },
  {
    "Session ID": "914798",
    "Title": "Operationalizing AI Interpretability",
    "Description": "Mechanistic interpretability is a frontier field that aims to reverse engineer neural networks. At Goodfire, we're operationalizing the latest in interpretability research by building Ember: the universal platform for neural programming. Ember decodes the neurons of an AI model to give direct, programmable access to its internal representations.\r\nIn this talk, we'll share more about what's unlocked by moving beyond black-box inputs and outputs, including entirely new ways to apply, train, and align AI models. We're excited for a future in which neural programming allows users to discover new knowledge hidden in their model, precisely shape its behaviors, and improve its performance. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Generative Media (14)",
    "Room": "Foothill F: Generative Media",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Mark Bissell",
    "Companies": "Goodfire AI",
    "Company Domains": "goodfire.ai",
    "Titles": "Applied Researcher"
  },
  {
    "Session ID": "914934",
    "Title": "The Web Browser Is All You Need",
    "Description": "(PLACEHOLDER) With the rise of MCP servers, A2A, and our trusty friend, OpenAPI, it turns our the web browser may be the default MCP server for the rest of the internet.\r\n\r\nIn this talk, we'll walk through how a web browsing tool is probably the only tool you'll need to enable production AI Agents. ",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "AI Infrastructure (05)",
    "Room": "SOMA: AI Architects",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Paul Klein IV",
    "Companies": "Browserbase",
    "Company Domains": "browserbase.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "915873",
    "Title": "How we hacked YC Spring 2025 batch’s AI agents",
    "Description": "We hacked 7 of the16 publicly-accessible YC X25 AI agents. This allowed us to leak user data, execute code remotely, and take over databases. All within 30 minutes each. In this session, we'll walk through the common mistakes these companies made and how you can mitigate these security concerns before your agents put your business at risk.",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "Security (13)",
    "Room": "Foothill C: Security",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Rene Brandel",
    "Companies": "Casco (YC X25)",
    "Company Domains": "gmail.com",
    "Titles": "Founder"
  },
  {
    "Session ID": "916104",
    "Title": "How to look at your data; what to look for, how to measure",
    "Description": "By the end of this talk, you'll understand what it takes to apply clustering techniques and data analysis to understand what is the valuable work that your AI application is doing through analyzing conversation histories and how to create generative evals to benchmark your newly discovered superpowers. ",
    "Session Format": "Talk",
    "Level": "Introductory and overview",
    "Scope": "Case Study/War Story",
    "Assigned Track": "Evals (12)",
    "Room": "Golden Gate Ballroom B: Evals",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Jeff Huber, Jason Liu",
    "Companies": "Chroma, 567 Studio",
    "Company Domains": "trychroma.com, jxnl.co",
    "Titles": "CEO, Machine Learning Engineer"
  },
  {
    "Session ID": "935969",
    "Title": "Building Agents (the hard parts!)",
    "Description": "AI workloads are rapidly shifting from AI being used for augmentation (co-pilots), to AI becoming responsible for full, end-to-end automation (agents). But building effective agents, and even more importantly, agent experiences that boost productivity requires many pieces. In this talk, we'll be covering the building blocks of agents, how to put them together, and what we've learned from top companies building agents along the way. ",
    "Session Format": "Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "AI in the Fortune 500 (L2)",
    "Room": "Golden Gate Ballroom C: AI in the Fortune 500",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Rita  Kozlov",
    "Companies": "cloudflare",
    "Company Domains": "gmail.com",
    "Titles": "Platform Engineer"
  },
  {
    "Session ID": "939640",
    "Title": "Towards Verified Superintelligence",
    "Description": "I describe a new paradigm towards open-endedly self-improving intelligence by scaling verification to remove the human data and supervision bottleneck. The objective is to achieve trustless alignment of superintelligence.",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Yerba Buena Ballroom 2-6: Reasoning + RL",
    "Scheduled At": "5 Jun 2025 02:50 PM",
    "Speakers": "Christian Szegedy",
    "Companies": "-",
    "Company Domains": "morph.so",
    "Titles": "researcher"
  },
  {
    "Session ID": "915826",
    "Title": "CI in the Era of AI: From Unit Tests to Stochastic Evals",
    "Description": "Software engineers have long understood that high-quality code requires comprehensive automated testing. For decades, our industry has relied on deterministic tests with clear pass/fail outcomes to ensure reliability. \r\n\r\nHigh-quality software depends on automated testing. That's certainly true at Zed, where we're building a next-generation native IDE in Rust. Zed runs at 120 frames per second, but it would also crash once a second if we didn't maintain and run a comprehensive suite of unit tests on every change.\r\n\r\nBut what happens when AI enters the equation?\r\n\r\nIn this talk, we'll explore how continuous integration evolves when working with AI components. \"Evals\" - parlance from the machine learning field - are fundamentally a continuation of the software testing tradition, but with a critical difference: they're inherently stochastic.\r\n\r\nZed's traditional CI goes to extreme lengths to eliminate non-determinism, as nobody likes having their pull requests blocked by flaky builds. We've even fully simulated network interactions with a deterministic random scheduler. AI components, however, forced us to confront a fundamental paradigm shift—uncertainty isn't a bug but an intrinsic feature of these systems, compelling us to embrace what we couldn't avoid.\r\n\r\nWe'll share our journey of reconceptualizing evals as \"stochastic unit tests\" - still verifying system behavior, but without binary pass/fail grades.\r\n\r\nWe'll discuss practical approaches to:\r\n- Thoughtfully building test suites for AI components\r\n- Shifting from red/green outcomes to \"shades of gray\"\r\n- Replacing build gates with trend analysis and performance monitoring\r\n- Maintaining engineering confidence despite statistical variance\r\n\r\nWhether you're incorporating AI into existing systems or building new AI-powered tools, this talk will provide practical insights into maintaining quality when determinism gives way to probability.",
    "Session Format": "Online Talk",
    "Level": "Intermediate",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Juniper: Expo Sessions",
    "Scheduled At": "5 Jun 2025 03:15 PM",
    "Speakers": "Nathan Sobo",
    "Companies": "GitHub",
    "Company Domains": "github.com",
    "Titles": "Software Engineer"
  },
  {
    "Session ID": "933474",
    "Title": "Cattle, not genies: building AI agents from first principles",
    "Description": "As magical as they may seem, AI agents should be treated like any other software system. This talk will cover the best practices in designing and building AI systems including observability, security hardening, and proper UX.",
    "Session Format": "",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 03:15 PM",
    "Speakers": "Kenneth DuMez",
    "Companies": "Graphite",
    "Company Domains": "graphite.com",
    "Titles": "Developer Relations Lead"
  },
  {
    "Session ID": "933575",
    "Title": "Amping it up: an experimental research demo of coding agents to uplevel humans building software",
    "Description": "If you're attending this conference, you've probably used agents to build new apps from scratch. Or fix a bug in your existing app. Or add a new feature. Or migrate some dependencies. Or review a messy code change to catch subtle bugs. Or grok a big legacy codebase. But have you tried to do all these things at once, in parallel, in front of a live audience? Come watch the spectacle as we redline context windows and try to stretch the power of LLMs and agentic tool use as far as we can",
    "Session Format": "",
    "Level": "Introductory and overview",
    "Scope": "Technical deep dive",
    "Assigned Track": "",
    "Room": "Willow: Expo Sessions",
    "Scheduled At": "5 Jun 2025 03:30 PM",
    "Speakers": "Beyang Liu",
    "Companies": "Sourcegraph",
    "Company Domains": "sourcegraph.com",
    "Titles": "CTO"
  },
  {
    "Session ID": "936042",
    "Title": "OpenRouter Keynote",
    "Description": "",
    "Session Format": "Keynote",
    "Level": "",
    "Scope": "",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 04:00 PM",
    "Speakers": "Alex   Atallah",
    "Companies": "OpenRouter",
    "Company Domains": "openrouter.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "936564",
    "Title": "Trends Across the AI Frontier",
    "Description": "The entire AI stack is developing faster than ever - from chips to infrastructure to models. How do you sort the signal from the noise? Artificial Analysis an independent benchmarking and insights company dedicated to helping developers and companies pick the right models and technologies for building applications. This talk will walk through the state of the frontier across the AI stack. ",
    "Session Format": "Keynote",
    "Level": "Introductory and overview",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 04:20 PM",
    "Speakers": "Micah Hill-Smith",
    "Companies": "Artificial Analysis",
    "Company Domains": "artificialanalysis.ai",
    "Titles": "CEO"
  },
  {
    "Session ID": "925974",
    "Title": "Prompt Engineering is Dead - Everything is a Spec",
    "Description": "[!!Subject to change!!]\r\n\r\nLarge models are trained through mountains of data and learned reward functions, yet - quis custodiet ipsos custodes? - what exactly are those amorphous blobs of data and rewards trying to specify? Building LLMs in any domain demands both clarity of thought and the skill to communicate those thoughts precisely - not only to other humans but to the models themselves. Without either, we risk unpleasant surprises.\r\n\r\nThis talk dives into:\r\n\t•\tWhy prompt spaghetti and data gumbo inevitably collapse at scale, unleashing behaviors we never intended - while a rigorously versioned spec keeps safety, personality, and UX firmly aligned, and makes incidents easier and faster to diagnose and fix.\r\n\t•\tHow OpenAI’s public Model Spec provides a clear template, complemented by emerging “dev tools” that turn hazy human intent into precise, human-and-machine-readable policy.\r\n\t•\tHow deliberative alignment training teaches models to first read and reason about the spec, boosting robustness without inflating context windows.\r\n\t•\tPractical tactics for catching ambiguity, untangling contradictions, and preserving global consistency. Plus, techniques for verifying that deployed models truly follow the contract we crafted.\r\n\r\nResources: Model Spec (2025‑04‑11) and Deliberative Alignment, Guan et al., 2024.",
    "Session Format": "Keynote",
    "Level": "Intermediate",
    "Scope": "Introductory (landscape)",
    "Assigned Track": "",
    "Room": "Keynote/General Session (Yerba Buena 7&8)",
    "Scheduled At": "5 Jun 2025 04:40 PM",
    "Speakers": "Sean Grove",
    "Companies": "OpenAI",
    "Company Domains": "gmail.com",
    "Titles": "Member of Technical Staff"
  }
]
